<PAD>,0
<UNK>,1
 ,2
n,3
e,4
/,5
的,6
，,7
a,8
r,9
o,10
t,11
i,12
s,13
。,14
u,15
l,16
p,17
c,18
用,19
、,20
S,21
d,22
能,23
h,24
b,25
P,26
m,27
C,28
g,29
一,30
在,31
.,32
和,33
A,34
现,35
数,36
实,37
D,38
行,39
I,40
R,41
可,42
以,43
对,44
目,45
开,46
L,47
y,48
件,49
v,50
中,51
有,52
发,53
据,54
文,55
于,56
M,57
T,58
是,59
个,60
要,61
基,62
理,63
持,64
支,65
了,66
使,67
成,68
-,69
k,70
本,71
熟,72
2,73
解,74
O,75
并,76
程,77
进,78
式,79
务,80
E,81
测,82
方,83
性,84
提,85
化,86
计,87
通,88
G,89
等,90
悉,91
1,92
分,93
为,94
F,95
作,96
完,97
项,98
功,99
N,100
f,101
码,102
需,103
关,104
过,105
试,106
K,107
x,108
模,109
时,110
上,111
前,112
编,113
语,114
到,115
；,116
器,117
）,118
应,119
代,120
统,121
集,122
设,123
（,124
相,125
接,126
定,127
不,128
B,129
户,130
法,131
系,132
算,133
标,134
3,135
多,136
内,137
源,138
档,139
言,140
V,141
工,142
构,143
生,144
入,145
：,146
供,147
出,148
架,149
端,150
学,151
下,152
同,153
动,154
配,155
量,156
Q,157
与,158
具,159
如,160
U,161
型,162
库,163
包,164
度,165
合,166
将,167
部,168
存,169
服,170
来,171
管,172
求,173
机,174
优,175
流,176
调,177
及,178
J,179
力,180
制,181
自,182
更,183
运,184
H,185
面,186
指,187
+,188
例,189
0,190
新,191
加,192
信,193
者,194
建,195
置,196
其,197
w,198
或,199
容,200
W,201
习,202
结,203
态,204
这,205
任,206
大,207
框,208
原,209
协,210
区,211
后,212
主,213
高,214
题,215
网,216
口,217
4,218
社,219
景,220
操,221
组,222
种,223
够,224
议,225
该,226
控,227
经,228
常,229
写,230
单,231
图,232
体,233
们,234
验,235
选,236
核,237
输,238
交,239
类,240
),241
点,242
间,243
场,244
线,245
础,246
引,247
插,248
会,249
展,250
技,251
问,252
软,253
序,254
查,255
布,256
证,257
处,258
我,259
术,260
群,261
X,262
当,263
云,264
特,265
析,266
参,267
署,268
息,269
j,270
q,271
业,272
规,273
案,274
储,275
表,276
但,277
比,278
(,279
些,280
块,281
果,282
台,283
已,284
识,285
重,286
最,287
知,288
好,289
示,290
之,291
练,292
增,293
整,294
步,295
平,296
子,297
效,298
执,299
人,300
令,301
推,302
括,303
:,304
函,305
译,306
所,307
导,308
备,309
版,310
_,311
限,312
格,313
全,314
此,315
级,316
向,317
准,318
形,319
读,320
较,321
环,322
望,323
改,324
也,325
而,326
6,327
5,328
从,329
载,330
且,331
维,332
别,333
视,334
微,335
各,336
境,337
8,338
命,339
仓,340
元,341
握,342
资,343
复,344
适,345
正,346
掌,347
确,348
保,349
范,350
索,351
升,352
深,353
产,354
地,355
义,356
得,357
符,358
助,359
希,360
无,361
注,362
络,363
检,364
层,365
强,366
考,367
询,368
期,369
取,370
善,371
心,372
列,373
连,374
像,375
率,376
速,377
传,378
快,379
节,380
由,381
密,382
扩,383
研,384
根,385
小,386
足,387
拟,388
监,389
界,390
添,391
报,392
只,393
告,394
z,395
很,396
达,397
他,398
外,399
因,400
决,401
明,402
客,403
域,404
给,405
收,406
手,407
异,408
至,409
障,410
便,411
擎,412
边,413
情,414
换,415
安,416
两,417
采,418
满,419
它,420
策,421
简,422
致,423
状,424
权,425
先,426
虚,427
路,428
事,429
预,430
利,431
消,432
脚,433
略,434
装,435
少,436
还,437
压,438
故,439
创,440
说,441
官,442
员,443
录,444
套,445
踪,446
含,447
领,448
“,449
依,450
段,451
页,452
低,453
”,454
转,455
针,456
辑,457
每,458
缩,459
启,460
跟,461
易,462
则,463
搜,464
你,465
述,466
认,467
被,468
打,469
评,470
修,471
阅,472
互,473
国,474
终,475
直,476
%,477
断,478
获,479
都,480
移,481
帮,482
水,483
三,484
样,485
次,486
况,487
镜,488
`,489
请,490
择,491
值,492
款,493
放,494
日,495
变,496
赖,497
精,498
即,499
续,500
离,501
意,502
阶,503
训,504
链,505
没,506
访,507
杂,508
键,509
让,510
然,511
位,512
带,513
栈,514
里,515
;,516
就,517
细,518
观,519
二,520
志,521
身,522
逻,523
非,524
盖,525
献,526
物,527
字,528
感,529
第,530
联,531
立,532
必,533
缘,534
排,535
照,536
签,537
着,538
独,539
轻,540
似,541
友,542
册,543
覆,544
贡,545
看,546
描,547
旨,548
典,549
道,550
长,551
共,552
耗,553
造,554
护,555
积,556
兴,557
9,558
做,559
嵌,560
见,561
订,562
负,563
回,564
跨,565
记,566
门,567
想,568
送,569
详,570
活,571
论,572
估,573
象,574
广,575
起,576
树,577
际,578
底,579
切,580
响,581
名,582
近,583
真,584
板,585
Y,586
=,587
何,588
总,589
趣,590
英,591
远,592
否,593
品,594
己,595
书,596
智,597
越,598
享,599
除,600
思,601
兼,602
片,603
尽,604
份,605
均,606
硬,607
演,608
风,609
周,610
稳,611
付,612
减,613
判,614
虑,615
质,616
条,617
清,618
销,619
热,620
误,621
随,622
往,623
频,624
驱,625
审,626
背,627
7,628
按,629
难,630
显,631
究,632
延,633
候,634
施,635
植,636
局,637
队,638
降,639
错,640
富,641
影,642
卷,643
专,644
>,645
划,646
商,647
仅,648
车,649
落,650
许,651
年,652
],653
丰,654
号,655
首,656
始,657
[,658
未,659
南,660
靠,661
探,662
泛,663
征,664
您,665
治,666
去,667
概,668
公,669
滤,670
荐,671
站,672
拥,673
仿,674
受,675
剪,676
挂,677
迟,678
师,679
窗,680
愿,681
张,682
飞,683
Z,684
裁,685
差,686
围,687
搭,688
补,689
么,690
充,691
极,692
空,693
某,694
初,695
海,696
另,697
音,698
念,699
科,700
追,701
占,702
缺,703
灵,704
句,705
<,706
阵,707
替,708
释,709
迁,710
警,711
把,712
矩,713
翻,714
径,715
几,716
暴,717
静,718
&,719
介,720
家,721
射,722
绍,723
反,724
露,725
篇,726
辅,727
航,728
佳,729
聚,730
昇,731
良,732
涉,733
仍,734
失,735
蓝,736
声,737
抽,738
阿,739
驶,740
齐,741
览,742
拆,743
驾,744
批,745
超,746
默,747
弹,748
锁,749
尝,750
费,751
登,752
借,753
践,754
侧,755
托,756
找,757
尔,758
隔,759
桨,760
游,761
称,762
粒,763
派,764
余,765
再,766
百,767
课,768
神,769
撑,770
封,771
损,772
混,773
觉,774
删,775
留,776
堆,777
天,778
光,779
词,780
莓,781
战,782
触,783
干,784
贝,785
拷,786
零,787
电,788
捷,789
又,790
若,791
恢,792
映,793
#,794
\,795
马,796
秀,797
跑,798
寻,799
须,800
》,801
融,802
《,803
衡,804
诸,805
？,806
爱,807
哈,808
久,809
隐,810
疏,811
屏,812
火,813
历,814
双,815
抓,816
势,817
址,818
什,819
—,820
',821
甚,822
牙,823
抱,824
料,825
串,826
止,827
骤,828
稀,829
校,830
坏,831
逐,832
撰,833
免,834
冲,835
章,836
色,837
桌,838
迭,839
瓶,840
博,841
缓,842
允,843
颈,844
亲,845
企,846
挑,847
遥,848
返,849
盘,850
孵,851
督,852
般,853
金,854
听,855
欢,856
绑,857
乘,858
】,859
幅,860
印,861
扎,862
拔,863
市,864
汇,865
讯,866
败,867
|,868
话,869
箱,870
$,871
染,872
众,873
遵,874
浮,875
避,876
哪,877
织,878
掉,879
拓,880
美,881
【,882
讨,883
鉴,884
团,885
熔,886
短,887
争,888
耦,889
毕,890
松,891
纳,892
匹,893
吐,894
继,895
循,896
夫,897
责,898
烈,899
渲,900
摄,901
吞,902
角,903
焰,904
槛,905
迹,906
渐,907
迎,908
激,909
{,910
挥,911
巴,912
轨,913
*,914
归,915
竞,916
尤,917
突,918
},919
阻,920
那,921
缝,922
草,923
晰,924
今,925
?,926
繁,927
答,928
授,929
待,930
史,931
蔽,932
洁,933
捕,934
梳,935
秒,936
递,937
暂,938
梯,939
卸,940
虽,941
既,942
世,943
申,944
健,945
潜,946
湖,947
船,948
惯,949
雅,950
担,951
价,952
十,953
弱,954
喜,955
遇,956
绿,957
头,958
丁,959
禅,960
浏,961
芯,962
漏,963
破,964
著,965
噪,966
停,967
死,968
室,969
侵,970
附,971
寄,972
临,973
桩,974
慢,975
洋,976
厂,977
太,978
割,979
防,980
阈,981
赛,982
洗,983
播,984
承,985
束,986
紧,987
宽,988
塞,989
属,990
杆,991
教,992
崩,993
夹,994
江,995
呈,996
懂,997
透,998
才,999
察,1000
媒,1001
睿,1002
额,1003
圾,1004
纯,1005
距,1006
眠,1007
固,1008
乏,1009
戳,1010
幺,1011
龙,1012
沿,1013
闭,1014
卓,1015
~,1016
半,1017
洞,1018
旋,1019
严,1020
钟,1021
蒙,1022
溃,1023
陆,1024
走,1025
愈,1026
垃,1027
沟,1028
涵,1029
池,1030
月,1031
蜥,1032
绝,1033
辨,1034
麒,1035
绘,1036
诉,1037
康,1038
栏,1039
亚,1040
^,1041
稿,1042
掘,1043
陷,1044
万,1045
醒,1046
敏,1047
谓,1048
早,1049
跃,1050
私,1051
逊,1052
！,1053
宕,1054
四,1055
普,1056
沌,1057
浪,1058
红,1059
击,1060
欧,1061
麟,1062
困,1063
旅,1064
伸,1065
轮,1066
刷,1067
守,1068
钻,1069
辐,1070
颜,1071
馈,1072
益,1073
剩,1074
劣,1075
倍,1076
散,1077
气,1078
华,1079
祖,1080
邻,1081
味,1082
巡,1083
缀,1084
黑,1085
拼,1086
禁,1087
汽,1088
拉,1089
刻,1090
园,1091
灯,1092
泡,1093
挖,1094
弃,1095
石,1096
废,1097
险,1098
举,1099
戏,1100
拍,1101
办,1102
谱,1103
讲,1104
职,1105
熵,1106
约,1107
曾,1108
综,1109
卡,1110
素,1111
琐,1112
抹,1113
柜,1114
画,1115
塔,1116
休,1117
焦,1118
折,1119
磁,1120
脱,1121
材,1122
唤,1123
欠,1124
俗,1125
隧,1126
遍,1127
碍,1128
扑,1129
顿,1130
腾,1131
截,1132
跳,1133
票,1134
壮,1135
巧,1136
济,1137
沙,1138
舰,1139
柱,1140
坐,1141
泰,1142
闻,1143
玩,1144
晓,1145
账,1146
店,1147
绪,1148
兰,1149
殊,1150
球,1151
衷,1152
父,1153
纷,1154
埋,1155
老,1156
五,1157
斗,1158
抗,1159
福,1160
钥,1161
假,1162
叉,1163
副,1164
漂,1165
兆,1166
慧,1167
乎,1168
叠,1169
膨,1170
召,1171
克,1172
唯,1173
雀,1174
"""",1175
省,1176
疑,1177
河,1178
凭,1179
尚,1180
朗,1181
锚,1182
震,1183
千,1184
诊,1185
剖,1186
花,1187
粗,1188
仪,1189
股,1190
渔,1191
舶,1192
怪,1193
予,1194
─,1195
尺,1196
米,1197
床,1198
山,1199
偏,1200
洛,1201
邮,1202
渡,1203
坚,1204
梁,1205
顺,1206
奇,1207
涌,1208
辩,1209
厚,1210
臂,1211
毋,1212
急,1213
奏,1214
顶,1215
旧,1216
薄,1217
霍,1218
叶,1219
壳,1220
棒,1221
劫,1222
塑,1223
医,1224
携,1225
稠,1226
横,1227
趋,1228
律,1229
却,1230
钮,1231
咕,1232
苛,1233
灾,1234
睡,1235
绳,1236
拒,1237
朝,1238
骨,1239
鸿,1240
拦,1241
泄,1242
旁,1243
筒,1244
诞,1245
木,1246
械,1247
司,1248
巨,1249
胀,1250
艇,1251
脸,1252
毎,1253
促,1254
帽,1255
填,1256
桥,1257
滑,1258
病,1259
踩,1260
右,1261
楚,1262
礁,1263
古,1264
牌,1265
尊,1266
尾,1267
丝,1268
亮,1269
胆,1270
璧,1271
阔,1272
努,1273
畏,1274
簇,1275
钉,1276
淘,1277
庸,1278
贴,1279
踏,1280
畴,1281
疗,1282
圈,1283
洲,1284
扫,1285
左,1286
滚,1287
途,1288
辆,1289
缆,1290
灰,1291
秘,1292
症,1293
丢,1294
筑,1295
艾,1296
匀,1297
抑,1298
藏,1299
湍,1300
偶,1301
摆,1302
蜻,1303
筛,1304
星,1305
浅,1306
瑞,1307
廉,1308
皆,1309
麻,1310
雏,1311
坦,1312
酬,1313
粹,1314
嗦,1315
艺,1316
帧,1317
皮,1318
啰,1319
铺,1320
攻,1321
牺,1322
旦,1323
伟,1324
伴,1325
糅,1326
旗,1327
伙,1328
吸,1329
抢,1330
凑,1331
伪,1332
酉,1333
白,1334
钩,1335
汲,1336
罪,1337
浓,1338
摘,1339
颖,1340
牲,1341
「,1342
壁,1343
·,1344
退,1345
绕,1346
抠,1347
√,1348
寸,1349
晚,1350
耐,1351
剥,1352
涨,1353
傅,1354
蜓,1355
扁,1356
疾,1357
揭,1358
吗,1359
呢,1360
残,1361
隶,1362
炙,1363
陌,1364
逃,1365
伐,1366
帐,1367
纸,1368
衔,1369
措,1370
暑,1371
营,1372
渠,1373
黄,1374
斯,1375
恶,1376
篡,1377
驻,1378
畅,1379
柔,1380
患,1381
裕,1382
夏,1383
衍,1384
匮,1385
鲁,1386
赏,1387
谁,1388
晟,1389
拿,1390
邦,1391
肯,1392
鼓,1393
蚂,1394
」,1395
掺,1396
昉,1397
!,1398
乐,1399
忽,1400
惜,1401
／,1402
抄,1403
妥,1404
痛,1405
居,1406
德,1407
胞,1408
纵,1409
庞,1410
α,1411
歧,1412
恒,1413
咬,1414
野,1415
枝,1416
桶,1417
倒,1418
@,1419
药,1420
刚,1421
蚀,1422
裸,1423
糙,1424
汉,1425
靶,1426
垂,1427
城,1428
卫,1429
沉,1430
励,1431
纬,1432
矢,1433
滞,1434
榜,1435
抖,1436
纲,1437
暇,1438
赋,1439
崇,1440
毫,1441
烦,1442
聊,1443
卖,1444
宿,1445
鼠,1446
迅,1447
宏,1448
棋,1449
龄,1450
譬,1451
蚁,1452
