/**
 * @file  峰会国际化配置入口
 * */
module.exports = {
    cn: {
        SUMMIT_BANNER: {
            MOBILE_IMG: "https://openeuler-website-beijing.obs.cn-north-4.myhuaweicloud.com/openEuler-summit-2021/images/%E6%AC%A7%E6%8B%89-375x300-%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F%E9%A6%96%E9%A1%B5.png",
            PC_IMG: "https://openeuler-website-beijing.obs.cn-north-4.myhuaweicloud.com/openEuler-summit-2021/images/1920x380%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F.png"
        },
        SUMMIT_INTRODUCE: "openEuler Summit 是由欧拉开源社区举办的开发者峰会。openEuler从服务器操作系统，升级为数字基础设施的操作系统，支持IT、CT、OT等数字基础设施全场景，覆盖服务器、云、边、嵌入式等各种形态的需求。伴随21.09版本的发布 openEuler 已经包含了服务器、云原生、边缘计算和嵌入式的四大应用场景。openEuler 通过开源开放，不断探索科技创新的边界，驱动物理世界与数字世界的深度融合。开发者、用户、社区贡献者、软件爱好者在 openEuler Summit 汇聚，驱动无止境的创新与拓展，闪耀数字时代星辰大海。",
        LIVETITLE: '操作系统产业峰会生态伙伴直播间',
        TEN_TITLE:'openEuler Summit 2021 直播间',
        PC_LIVEIMG: '/img/summit/home/zh-pc-liveroom.png',
        MOBILE_LIVEIMG: '/img/summit/home/zh-mobile-liveroom.png',
        SUMMITLIVE: {
           NINE :[
            {
                ID: 9862,
                THEME: '操作系统产业峰会2021',
                TIME: '09:30-11:30',
                OPTION: '09:30-11:30 操作系统产业峰会2021',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9862?lang=zh&thirdId='
            },
            {
                ID: 9863,
                THEME: '麒麟软件',
                TIME: '14:00-16:40',
                OPTION: '14:00-16:40 麒麟软件',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9863?lang=zh&thirdId='
            },
            {
                ID: 9900,
                THEME: '麒麟信安',
                TIME: '14:00-16:40',
                OPTION: '14:00-16:40 麒麟信安',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9900?lang=zh&thirdId='
            },
            {
                ID: 9901,
                THEME: '统信',
                TIME: '14:00-17:00',
                OPTION: '14:00-17:00 统信',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9901?lang=zh&thirdId='
            },
            {
                ID: 9864,
                THEME: '中科创达',
                TIME: '14:00-16:40',
                OPTION: '14:00-16:40 中科创达',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9864?lang=zh&thirdId='
            },
            {
                ID: 9865,
                THEME: '普华基础软件',
                TIME: '14:00-16:30 ',
                OPTION: '14:00-16:30 普华基础软件',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9865?lang=zh&thirdId='
            },
           ],
           TEN : [
            {
                ID: 9866,
                THEME: 'openEuler Summit 2021',
                TIME: '9:30-11:55 ',
                OPTION: '9:30-11:55 openEuler Summit 2021',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9866?lang=zh&thirdId='
            },
            {
                ID: 9867,
                THEME: '内核',
                TIME: '13:00-17:30 ',
                OPTION: '13:00-17:30 内核分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9867?lang=zh&thirdId='
            },
            {
                ID: 9868,
                THEME: '云&虚拟化',
                TIME: '13:00-18:00 ',
                OPTION: '13:00-18:00 云&虚拟化分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9868?lang=zh&thirdId='
            },
            {
                ID: 9869,
                THEME: '兼容性',
                TIME: '13:00-17:30 ',
                OPTION: '13:00-17:30 兼容性分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9869?lang=zh&thirdId='
            },
            {
                ID: 9870,
                THEME: '安全&可靠性&运维',
                TIME: '13:00-17:30 ',
                OPTION: '13:00-17:30 安全&可靠性&运维分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9870?lang=zh&thirdId='
            },
            {
                ID: 9871,
                THEME: '分布式&多样性计算',
                TIME: '13:00-18:00 ',
                OPTION: '13:00-17:30 分布式&多样性计算分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9871?lang=zh&thirdId='
            },
            {
                ID: 9872,
                THEME: '边缘&嵌入式',
                TIME: '13:00-17:30 ',
                OPTION: '13:00-17:30 边缘&嵌入式分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9872?lang=zh&thirdId='
            },
           ]
        },
        AGENDA: {
            WEB_TITLE: '/img/summit/summit2021/zh-pc-summit2021.png',
            MOBILE_TITLE: '/img/summit/summit2021/zh-mobile-summit2021.png',
            DATE: ['11月09日', '11月10日', '上午', '下午'],
            SUB_FORUM: '操作系统产业峰会生态伙伴分论坛',
            FORUM_HEAD: ['麒麟软件', '麒麟信安', 'SUSE', '统信软件', '中科创达', '普华基础软件'],
            FORENOON_AGENDA_9: [
                {
                    TIME: '09:30 - 09:45',
                    THEME: '开场致辞',
                    SPEAKER: '神秘嘉宾',
                },
                {
                    TIME: '09:45 - 10:00',
                    THEME: '欧拉开源操作系统重大发布',
                },
                {
                    TIME: '10:00 - 10:10',
                    THEME: '操作系统发展展望',
                    SPEAKER: '中国工程院院士',
                },
                {
                    TIME: '10:10 - 10:20',
                    THEME: '立根铸魂，共建操作系统新生态',
                    SPEAKER: '华为',
                },
                {
                    TIME: '10:20 - 10:25',
                    THEME: '操作系统产业宣誓',
                },
                {
                    TIME: '10:25 - 10:55',
                    THEME: '行业用户实践分享',
                    SPEAKER: '运营商、金融等行业重磅嘉宾'
                },
                {
                    TIME: '10:55 - 11:05',
                    THEME: '携手欧拉开源创新，服务中国数字时代',
                    SPEAKER: '麒麟软件',
                },
                {
                    TIME: '11:05 - 11:15',
                    THEME: '扎根开源生态，服务中国企业，帮助中国开源系统走向世界',
                    SPEAKER: 'SUSE',
                },
                {
                    TIME: '11:15 - 11:20',
                    THEME: '欧拉生态创新中心发布',
                },
                {
                    TIME: '11:20 - 11:30',
                    THEME: '智能基座 · 欧拉人才发展加速计划发布',
                },
            ],
            FORENOON_AGENDA_10: [
                {
                    TIME: '09:30 - 09:35',
                    THEME: '欢迎致辞',
                    SPEAKER: '杨涛',
                    POSITION: '开放原子开源基金会理事长'
                },
                {
                    TIME: '09:35 - 09:45',
                    THEME: '凝聚创新力量 逐梦数字时代星辰大海',
                    SPEAKER: '江大勇',
                    POSITION: '欧拉开源社区理事长'
                },
                {
                    TIME: '09:45 - 09:50',
                    THEME: '欧拉开源社区理事会升级仪式',
                    SPEAKER: '邱成锋',
                    POSITION: '欧拉开源社区秘书长'
                },
                {
                    TIME: '09:50 - 09:55',
                    THEME: '欧拉开源社区技术委员会换届升级仪式',
                    SPEAKER: '邱成锋',
                    POSITION: '欧拉开源社区秘书长'
                },
                {
                    TIME: '09:55 - 10:10',
                    THEME: '全场景欧拉 - 唯有无边界开放才能无止境增长',
                    SPEAKER: '胡欣蔚',
                    POSITION: '欧拉开源社区技术委员会主席'
                },
                {
                    TIME: '10:10 - 10:40',
                    THEME: 'openEuler&Friends 2.0-协作联创激发无限可能',
                    SPEAKER: '中国电信、中国移动、中国联通、中科创达、华为、品高软件'
                },
                {
                    TIME: '10:40 - 10:55',
                    THEME: '中国银行操作系统创新实践',
                    SPEAKER: '中国银行和麒麟软件联合演讲',
                },
                {
                    TIME: '10:55 - 11:10',
                    THEME: '中国移动云原生生态创新实践',
                    SPEAKER: '中国移动和SUSE联合演讲',
                },
                {
                    TIME: '11:10 - 11:25',
                    THEME: '国家电网调度控制系统创新实践',
                    SPEAKER: '中国电科院和麒麟信安联合演讲'
                },
                {
                    TIME: '11:25 - 11:40',
                    THEME: '中国邮政业务应用创新实践',
                    SPEAKER: '中国邮政和统信软件联合演讲',
                },
                {
                    TIME: '11:40 - 11:50',
                    THEME: '仰望星空-操作系统演讲与前沿发展思考',
                    SPEAKER: '陈海波',
                    POSITION: '上海交通大学教授 、华为操作系统首席科学家'
                },
                {
                    TIME: '11:50 - 11:55',
                    THEME: '欧拉开源社区超级用户大奖',
                    SPEAKER: '高巍',
                    POSITION: '欧拉开源社区用户委员会主席'
                }
            ],
            AFTERNOON_AGENDA_9: [
                // 麒麟软件
                [
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '领导致辞',
                        SPEAKER: '华为领导'
                    },
                    {
                        TIME: '14:10 - 14:25',
                        THEME: '合作共赢，生态共生',
                        SPEAKER: '孔金珠',
                        POSITION: '麒麟软件 高级副总经理'
                    },
                    {
                        TIME: '14:25 - 14:40',
                        THEME: '开源新时代-麒麟软件积极拥抱开源社区',
                        SPEAKER: '侯健',
                        POSITION: '麒麟软件 服务器研发部技术总监'
                    },
                    {
                        TIME: '14:40 - 14:55',
                        THEME: '中国联通自主操作系统实践经验分享',
                        SPEAKER: '肖微',
                        POSITION: '联通软研院'
                    },
                    {
                        TIME: '14:55 - 15:00',
                        THEME: '麒麟鲲鹏联合创新实验室揭牌',
                        SPEAKER: '刘海涛、高巍',
                    },
                    {
                        TIME: '15:00 - 15:10',
                        THEME: '北京鲲鹏联合创新中心领导致辞',
                        SPEAKER: '刘海涛',
                        POSITION: '北京鲲鹏联合创新中心 首席运营官'
                    },
                    {
                        TIME: '15:10 - 15:15',
                        THEME: '麒麟创客北京·鲲鹏应用创新大赛2021颁奖仪式',
                        SPEAKER: '麒麟软件、华为领导'
                    },
                    {
                        TIME: '15:15 - 15:25',
                        THEME: '幸运抽奖 &茶歇',
                    },
                    {
                        TIME: '15:25 - 15:40',
                        THEME: '开放联合，共建软件生态',
                        SPEAKER: '刘勇鹏',
                        POSITION: '飞腾 副总裁、软件技术方案中心总经理'
                    },
                    {
                        TIME: '15:40 - 15:55',
                        THEME: '护航国产操作系统 打造安全计算环境',
                        SPEAKER: '李栋',
                        POSITION: '奇安信 椒图事业部副总经理'
                    },
                    {
                        TIME: '15:55 - 16:10',
                        THEME: '价值驱动国产基础软硬件协同发展 ',
                        SPEAKER: '王容多',
                        POSITION: '同方 战略生态中心总经理 / 行业销售中心总经理'
                    },
                    {
                        TIME: '16:10 - 16:25',
                        THEME: '携手打造基础软件根技术，助力用户创造更大价值 ',
                        SPEAKER: '肖枫',
                        POSITION: '海量数据 总裁'
                    },
                    {
                        TIME: '16:25 - 16:40',
                        THEME: '国产数据库与操作系统的合作',
                        SPEAKER: '宋瑞',
                        POSITION: '人大金仓 高级副总裁'
                    },
                    {
                        TIME: '16:40 - 16:55',
                        THEME: '国产中间件创新与应用',
                        SPEAKER: '谢耘',
                        POSITION: '东方通 首席科学家'
                    },
                    {
                        TIME: '16:55 - 17:10',
                        THEME: '基于麒麟V10的分布式中间件新核心',
                        SPEAKER: '成勇斌',
                        POSITION: '金蝶天燕 副总经理'
                    },
                    {
                        TIME: '17:10 - 17:20',
                        THEME: '幸运抽奖',
                    },
                ],
                // 麒麟信安
                [
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '欢迎致辞',
                        SPEAKER: '麒麟信安领导、华为领导',
                    },
                    {
                        TIME: '14:10 - 14:25',
                        THEME: 'openEuler技术分享',
                        SPEAKER: '欧拉开源社区技术专家'
                    },
                    {
                        TIME: '14:25 - 14:40',
                        THEME: '根植欧拉开源社区构建麒麟信安操作系统',
                        SPEAKER: '陈松政',
                        POSITION: '麒麟信安高级副总裁'
                    },
                    {
                        TIME: '14:40 - 14:50',
                        THEME: '欢乐抽奖',
                    },
                    {
                        TIME: '14:50 - 15:05',
                        THEME: '麒麟信安操作系统的工控属性',
                        SPEAKER: '石勇',
                        POSITION: '麒麟信安操作系统产品总监'
                    },
                    {
                        TIME: '15:05 - 15:20',
                        THEME: '麒麟信安操作系统的云原生属性',
                        SPEAKER: '孙利杰',
                        POSITION: '麒麟信安操作系统、云计算产品线研发总监'
                    },
                    {
                        TIME: '15:20 - 15:30',
                        THEME: '联合实验室揭牌仪式',
                    },
                    {
                        TIME: '15:30 - 15:40',
                        THEME: '欢乐抽奖',
                    },
                    {
                        TIME: '15:40 - 15:55',
                        THEME: 'CentOS停服后国产操作系统的蓝海商机 ',
                        SPEAKER: '任启',
                        POSITION: '麒麟信安高级副总裁'
                    },
                    {
                        TIME: '15:55 - 16:10',
                        THEME: '麒麟信安操作系统在电力调度和航天测发控核心系统创新应用实践',
                        SPEAKER: '王攀',
                        POSITION: '麒麟信安副总裁'
                    },
                    {
                        TIME: '16:10 - 16:30',
                        THEME: '圆桌论坛 ',
                        SPEAKER: '合作伙伴'
                    },
                    {
                        TIME: '16:30 - 16:40',
                        THEME: '欢乐抽奖、结束',
                    },
                ],
                // SUSE
                [
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '数硕Linux的定位与发展',
                        SPEAKER: '江永清',
                        POSITION: 'SUSE 大中华区董事长'
                    },
                    {
                        TIME: '14:10 - 14:20',
                        THEME: '欧拉开源社区支持服务发布仪式',
                        SPEAKER: '江永清',
                        POSITION: 'SUSE 大中华区董事长',
                        SPEAKER2: '陈伟',
                        POSITION2: 'SUSE 大中华区Service Director'
                    },
                    {
                        TIME: '14:20 - 14:40',
                        THEME: '欧拉开源社区支持服务',
                        SPEAKER: '陈伟',
                        POSITION: 'SUSE 大中华区Service Director'
                    },
                    {
                        TIME: '14:40 - 15:10',
                        THEME: '数硕Linux技术展望',
                        SPEAKER: '刘恺',
                        POSITION: 'SUSE Euler PD Manager'
                    },
                    {
                        TIME: '15:10 - 15:25',
                        THEME: '茶歇',
                    },
                    {
                        TIME: '15:25 - 15:55',
                        THEME: 'Rancher + iSulad解决方案',
                        SPEAKER: '江鹏',
                        POSITION: 'SUSE 大中华区技术总监'
                    },
                    {
                        TIME: '15:55 - 16:25',
                        THEME: '助力国产硬件，构建自主可控业务生态',
                        SPEAKER: '于明',
                        POSITION: '长城信息股份有限公司副总裁，人工智能所所长'
                    },
                    {
                        TIME: '16:25 - 16:55',
                        THEME: '云原生安全架构的应用实践',
                        SPEAKER: '刘玮',
                        POSITION: '上海缔赛信息技术有限公司总经理'
                    },
                    {
                        TIME: '16:55 - 17:10',
                        THEME: '观众互动',
                        SPEAKER: '现场主持',
                    },
                ],
                // 统信软件
                [
                    {
                        TIME: '13:30 - 14:00',
                        THEME: '签到入场',
                    },
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '欢迎致辞',
                        SPEAKER: '朱建忠',
                        POSITION: '统信软件 高级副总裁'
                    },
                    {
                        TIME: '14:10 - 14:40',
                        THEME: '打造数字时代新底座——统信服务器操作系统',
                        SPEAKER: '孟杰',
                        POSITION: '统信软件 服务器OS产线副总经理'
                    },
                    {
                        TIME: '14:40 - 15:10',
                        THEME: '打造统信UOS操作系统新生态',
                        SPEAKER: '张木梁',
                        POSITION: '统信软件 生态中心副总经理'
                    },
                    {
                        TIME: '15:10 - 15:40',
                        THEME: 'openEuler 技术分享',
                        SPEAKER: 'openEuler 技术专家',
                    },
                    {
                        TIME: '15:40 - 15:50',
                        THEME: '茶歇',
                    },
                    {
                        TIME: '15:50 - 16:05',
                        THEME: '共建生态、合作共赢',
                        SPEAKER: '邓忠良',
                        POSITION: '同方计算机产业本部副总经理'
                    },
                    {
                        TIME: '16:05 - 16:20',
                        THEME: '数据相联，探索价值',
                        SPEAKER: '莫良伟',
                        POSITION: '宝德 软件部总监'
                    },
                    {
                        TIME: '16:20 - 16:35',
                        THEME: '万亿级湖仓一体架构下的统一数据服务平台应用实践',
                        SPEAKER: '陈元熹 ',
                        POSITION: '巨杉数据库',
                        POSITION2: '研发资深总监',
                        POSITION3: '首席架构师'
                    },
                    {
                        TIME: '16:35 - 16:50',
                        THEME: '协同办公系统信创实践与探索',
                        SPEAKER: '杨竹君 ',
                        POSITION: '泛微 政务副总经理'
                    },
                    {
                        TIME: '16:50 - 17:05',
                        THEME: '信创数据交换平台最佳实践 ',
                        SPEAKER: '臧一超 ',
                        POSITION: '普元信息 数智研究院 副总经理'
                    },
                    {
                        TIME: '17:05 - 17:20',
                        THEME: '融合信创生态，打造安全高效的地理信息系统',
                        SPEAKER: '周丹',
                        POSITION: '中地数码 北京副总经理'
                    },
                    {
                        TIME: '17:20 - 17:30',
                        THEME: '抽奖环节',
                    },
                ],
                // 中科达创
                [
                    {
                        TIME: '13:30 - 14:00',
                        THEME: '签到入场',
                    },
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '主持人开场',
                        SPEAKER: '刘寿永',
                        POSITION: '中科创达首席架构师'
                    },
                    {
                        TIME: '14:10 - 14:30',
                        THEME: '云原生边缘计算平台架构与实践',
                        SPEAKER: '王杰章',
                        POSITION: '华为云原生高级工程师'
                    },
                    {
                        TIME: '14:30 - 14:50',
                        THEME: '浅析边缘计算中间件',
                        SPEAKER: '徐晓晶',
                        POSITION: '中科创达软件架构师'
                    },
                    {
                        TIME: '14:50 - 15:10',
                        THEME: 'Intel 边缘软件中心介绍',
                        SPEAKER: '冯伟',
                        POSITION: 'Intel边缘计算架构师'
                    },
                    {
                        TIME: '15:10 - 15:20',
                        THEME: '茶歇 & 交流',
                    },
                    {
                        TIME: '15:20 - 15:40',
                        THEME: '端侧边缘计算赋能千行百业',
                        SPEAKER: '朱勇',
                        POSITION: '中科创达AI技术中心负责人'
                    },
                    {
                        TIME: '15:40 - 16:00',
                        THEME: 'EdgeX加速边缘原生应用',
                        SPEAKER: '路广',
                        POSITION: 'VMWare 中国研发总监'
                    },
                    {
                        TIME: '16:00 - 16:20',
                        THEME: '融合发展助力智能汽车产业腾飞',
                        SPEAKER: '王志杰',
                        POSITION: '中科创达智能汽车SOA产品经理'
                    },
                    {
                        TIME: '16:20 - 16:40',
                        THEME: '双碳背景下的边缘计算和虚拟电厂',
                        SPEAKER: '樊小毅',
                        POSITION: '江行智能CTO'
                    },
                ],
                // 普华基础软件
                [
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '致词',
                        SPEAKER: '华为领导'
                    },
                    {
                        TIME: '14:10 - 14:30',
                        THEME: '开场发言',
                        SPEAKER: '沈翔',
                        POSITION: '普华基础软件事业部总经理'
                    },
                    {
                        TIME: '14:30 - 15:00',
                        THEME: '基于欧拉开源操作系统软硬件新品发布',
                        SPEAKER: '董自强',
                        POSITION: '普华基础软件产品部总经理'
                    },
                    {
                        TIME: '15:00 - 15:20',
                        THEME: '茶歇 & 抽奖环节',
                    },
                    {
                        TIME: '15:20 - 15:50',
                        THEME: '圆桌论坛：多样性算力、业务模式创新模式影响下，操作系统产业未来发展',
                    },
                    {
                        TIME: '15:50 - 16:10',
                        THEME: '深耕基础软件根技术，普华的铸魂之路',
                        SPEAKER: '王伶卓',
                        POSITION: '普华基础软件事业部技术副总'
                    },
                    {
                        TIME: '16:10 - 16:30',
                        THEME: '聚焦行业，普华基础软件多场景应用分享',
                        SPEAKER: '王江涛',
                        POSITION: '普华基础软件高级安全专家'
                    },
                    {
                        TIME: '16:30 - 16:50',
                        THEME: '欢乐抽奖、结束',
                    },
                ],
            ],
            AFTERNOON_AGENDA_10: {
                TIME_LIST: ['13:00-13:30', '13:30-14:00', '14:00-14:30', '14:30-15:00', '15:00-15:30', '15:30-16:00', '16:00-16:30', '16:30-17:00', '17:00-17:30', '17:30-18:00'],
                CARD_LIST: [
                    {
                        TITLE: ['Session 1', '内核'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: '网络新技术MPTCP原理，协议和应用',
                                SPEAKER: ['唐葛亮 SUSE Linux'],
                                DESC: ['介绍网络新技术MPTCP(Multipath TCP)原理和协议，以及当前MPTCP upstream社区的状态，最后和大家讨论MPTCP相关应该场景。']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: '内核热升级技术的应用实践',
                                SPEAKER: ['尹秀江 麒麟软件有限公司', '何静娴 华为'],
                                DESC: ['内核热升级是openEuler社区原生孵化的一项技术，为解决内核CVE漏洞和减少系统宕机时间提供了有利保障，本次议题主要介绍内核热升级技术及分享在麒麟系统上的实践经验']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: '内存分级扩展在天翼云上的实践',
                                SPEAKER: ['张俊平 天翼云科技公司'],
                                DESC: ['使用傲腾内存，虚拟机内存超配，提升内存性价比，提升虚拟机性能']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: 'RISC-V Linux 异构多核架构实现与挑战',
                                SPEAKER: ['Tan Ley Foon 赛昉'],
                                DESC: ['一． 介绍异构多核架构', '二． 介绍Linux 内核对异构多核架构的支持: Energy Awareness Scheduling (EAS) and Capacity Awareness Scheduling (CAS)', '三． RISC-V架构对于异构多核架构的实现与挑战']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: 'Bond 3+高可靠冗余通信解决方案',
                                SPEAKER: ['秦云高 湖南麒麟信安科技股份有限公司'],
                                DESC: ['高可靠性网络通信在国家电网、金融、航天领域的应用中至关重要。', '本方案通过增强Linux内核bond 3广播模式，', '1. 实现UDP零重包，网络故障时自动链路切换的可靠冗余通信。', '2. 实现TCP网络故障时零延时最高可靠冗余通信。']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: '虚拟化技术在SW64自主架构的探索与实践',
                                SPEAKER: ['张毅 中电科申泰信息科技有限公司'],
                                DESC: ['1. Cpu虚拟化在申威架构上的探索与实践：接轨主流，实现了申威架构下的kvm；优化了申威架构下的中断虚拟化（时钟中断、核间中断），明显提高了中断性能。', '2. 内存虚拟化在申威架构上的探索与实践：设计了一种有别于x86架构实现的影子页表机制，该机制充分利用了申威架构的特点。并把它实现，内存虚拟化（影子页表）的相对开销数据优于x86。', '3. IO虚拟化在申威架构上的探索与实践：设计并实现了申威架构下VFIO与IOMMU：以新的驱动方式代替设备原有驱动；实现了申威架构下二级页表映射，并且实现8k和8M的页面粒度支持；以一种新的地址方式来替代真实的物理地址以增强内存的连续性和安全性。目前支持千兆、万兆网卡的设备直通。']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: '内核和进程热补丁技术的实现与应用',
                                SPEAKER: ['唐彬  中国移动云能力中心'],
                                DESC: ['在日常生产过程中，经常会遇到bug或者cve等问题需要升级内核，而当前升级内核需要重启系统，这会影响业务的连续性，为了最大限度避免重启服务器，采用热补丁的方式来修复内核bug或者cve漏洞，本主题主要介绍x86与arm64架构下的内核热补丁技术实现与应用']
                            },
                            {
                                TIME: '17:00-17:30',
                                THEME: '支持多任务的共享虚拟内存池技术',
                                SPEAKER: ['丁天虹 华为技术有限公司'],
                                DESC: ['Linux的多任务间的共享内存对SPA（Share Physiacl Address）支持比较完善，但是在支持SVA（Share Virtual Address）上使用并不方便，任务间如果要获取统一的虚拟地址，需要独立实现地址分配和管理的框架，我们在内核实现了一致性内存管理技术（Share Pool），主要解决CPU多任务之间共享虚拟地址的问题，可以较为方便的为多应用提供统一虚拟地址，该技术适合Linux在AI计算等应用场景的使用']
                            },
                        ]
                    },
                    {
                        TITLE: ['Session 2', '云&虚拟化'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: '不同Arm厂商的CPU互相模拟',
                                SPEAKER: ['仇大玉 华云数据控股集团有限公司'],
                                DESC: ['在公有云或者专属云内，很多时候CPU架构是相通的但是厂商却不一样，尤其在ARM服务器中，默认都是host虚拟化模式，无法屏蔽底层硬件差异，除全软件模拟的方式，但是性能损耗严重，本次topic就如何实现屏蔽底层差异的硬件虚拟化方式下，实现不同ARM Vendor 的CPU互相模拟']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: 'Capsule：全场景统一的新一代 Hypervisor',
                                SPEAKER: ['吴斌 华为'],
                                DESC: ['Capsule是完全由openEuler社区控制的新型Hypervisor项目。类似KVM，Capsule充分使能不同CPU体系的硬件辅助虚拟化能力。不同的是，Capsule采用Rust语言编写以带来更大的安全性。另外，Capsule重塑了Hypervisor架构，使它既可以支持普通虚拟机(满足多种多样的企业应用)，也可以支持安全容器(满足容器化负载应用)，同时还可以支持逻辑分区(满足实时类应用)，真正做到统一各类生态，支持IT/CT/OT全场景应用。']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: '基于欧拉开源操作系统的云底座操作系统NestOS',
                                SPEAKER: ['杜奕威 麒麟软件有限公司'],
                                DESC: ['NestOS是在openEuler社区孵化的云底座操作系统，搭载isulad，podman，docker等主流容器基础平台，可以适应各种不同的基础设施环境，使系统具备十分便捷的集群组建能力，与OKD紧密集成。同时NestOS可以安全的进行系统升级与回滚，可用于大规模下安全的运行容器化工作负载。']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: '摄像头虚拟化',
                                SPEAKER: ['夏华 湖南麒麟信安科技股份有限公司'],
                                DESC: ['桌面云行业，通常使用usbredir作为核心技术进行usb类设备的重定向。但实际场景中，诸如usbvideo类设备，由于其过于庞大的数据流交互，收带宽限制，在云桌面场景下，使用起来非常困难。为了应对该场景，我们采用了最新的XX方案进行摄像头重定向，其根本原理在于，把交互数据的图像数据部分进行压缩，在usbredir的客户端（设备使用端）和服务端（设备接入端）两段，分别布置插件。在服务端，针对性识别出图像数据流，并模拟uvc驱动的工作，把usb数据流（urb包）整理成完整的图片帧（frame），然后对图片帧进行x264的压缩，压缩之后的数据继续通过usbredir传送到客户端。客户端的插件识别到是图片帧数据后，对其进行解压，并把图片帧还原为urb包。以此达成网络间数据的压缩功能（图片压缩，减少包头冗余）。并且以usbredir插件的行事开发。使其具有良好的兼容性（usbredir本身对各平台的兼容性都很优秀）。']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: '亚信科技技术中台全面兼容欧拉生态解决方案',
                                SPEAKER: ['薛浩 亚信科技'],
                                DESC: ['亚信科技的技术中台，采用完整的云原生技术体系构建，历经运营商等行业的大型系统建设上云支撑的考验，已经形成了包括从多云基础设施管理、云原生IaaS的云OS产品、云原生PaaS、边缘云MEC PaaS、Devops等技术中台能力的产品体系，服务公司各个业务产品线。', '云OS，通过统一的云原生架构的平台产品上实现主流公有云、第三方私有云产品，自建云原生IaaS的统一构建和云服务管理。通过k8s云原生的技术构建云OS的统一管理控制面，扩展支持多个第三方云的服务接入，同时也可以基于该控制面基础上管理Openstack和kubernetes（通过扩展kube-virt，kube-ovn等云原生虚拟化组件）来构建IaaS服务。在整个平台的底层计算基础设施兼容性结合华为的鲲鹏+欧拉操作系统实现虚拟机、存储、网络等基础设施云原生虚拟机化能力的构建和开放。', '全域PaaS，包括数据中心级和边缘两套产品，通过一套云原生的架构基础设施层可以结合云OS产品，也可以直接兼容第三方云平台能力，通过PaaS中的弹性计算支持的多平面、mesos和k8s的多集群的纳管和开放服务的能力，在平面级和集群级可以兼容性结合华为的鲲鹏+欧拉操作系统实现PaaS层面向业务和应用的全栈技术服务，已完成落地并服务多运营商客户的CRM、BOSS等核心系统化的国产鲲鹏、欧拉+x86异构双平面的资源池的支撑体系中，目前还在推进结合欧拉打通和边缘MEC PaaS的协同的解决方案，同时推向垂直行业信息化领域。']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: '基于云原生技术分布式构建 Linux 发行版的实践分享',
                                SPEAKER: ['王建民 中国科学院软件研究所'],
                                DESC: ['EulixOS 是最早一批基于 openEuler 操作系统研发的发行版之一。在发行版的研发过程中，时常面对编译构建周期长、依赖关系复杂、软件包迭代频繁的问题，进而时常导致研发中版本不稳定、软件包合入相互等待的问题，尤其是在编译资源有限的情况下。EulixOS在研发过程中，结合团队、资源都有限的情况下，结合云原生技术对编译构建的改造，实现了较为轻量级、易部署、多架构、分布式的编译构建系统，对于更多团队基于openEuler 操作系统进行二次的商业发行版定制有借鉴意义。']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: '从云计算谈系统架构演化趋势',
                                SPEAKER: ['汪照辉  中国银河证券'],
                                DESC: ['对于企业IT系统构建，开源的基础操作是基本的底座，但企业IT系统融合建设的趋势已经非常明显，传统单体建设的思路已经不合时宜，所以对很多企业来说要逐步实现基础设施资源、基础平台、业务应用系统的融合，以适应业务和技术发展的需要。从虚拟化、资源池到超融合、多云管理等，其实目的都是为了实现基础设施资源的融合，能够为上层业务系统提供用之不竭的资源能力。其实从这张图我们可能很清晰的看到多云管理（混合云管理）的重要价值。对于大部分企业来说，多云管理平台不但要管理私有云、公有云，还可能需要管理企业自身的很多物理服务器，以及虚拟化平台所提供的虚拟机管理，这样才能更好的支持上层的容器的调度和管理，以满足不同业务应用容器化对不同基础设施资源的需求。所以企业系统建设中，就不能只考虑单一系统建设，必须要考虑系统与系统之间的关系，就像我们所说的，容器云平台和云管平台就是很紧密的支撑关系，而云管则可能管理着企业的物理服务器、虚拟化、超融合、网络资源、存储资源、私有云、行业云、公有云等基础设施资源，容器云平台又支撑着企业的业务应用，运行着微服务架构的中台服务、中间件、甚至轻量数据库等。所以这是一个整体的体系建设，这也是我们一直提倡“平台融合”的建设思路。当然这并不容易，一个“中台”就让无数企业铩羽而归、爱恨交加，但整个IT系统的建设趋势是逐步走向融合的，系统与系统之间需要标准化的API，就像我们一直说的积木，彼此间的切口要规则、能契合，才能比较快的搭成期待的作品。']
                            },
                            {
                                TIME: '17:00-17:30',
                                THEME: '基于可进化架构的新一代云基础设施',
                                SPEAKER: ['高广生 易捷行云'],
                                DESC: ['面对客户业务快速变化，云平台本身应具备可进化能力，EasyStack的易捷行云新一代云基础设施ECF（EasyStack Cloud Foundation）以开源生态产品化为基础，进行自主创新设计和研发构建的基于数字原生架构的一体化、场景化、可进化的全新一代云平台。已有超过500个客户在使用该产品，云基础设施ECF一套软件栈可以同时支持x86，Arm多种指令集，同时提供包括容器，云主机，裸金属多种算力，支持一个Region同时支持多种CPU架构服务器即一云多芯，同时具备全栈全平⾯OTA（Over The Air）能力，可以平滑⽆感升级包含操作系统在内的所有云平台软件，将不再受限于软件版本的限制，从⽽在某种意义上实现云平台永续⽣命周期。']
                            },
                            {
                                TIME: '17:30-18:00',
                                THEME: '虚拟化硬件加速-vDPA框架以及新浪私有云实践',
                                SPEAKER: ['杨云鹏 新浪'],
                                DESC: ['']
                            },
                        ]
                    },
                    {
                        TITLE: ['Session 3', '兼容性'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: 'HPC应用基于openEuler的迁移实践',
                                SPEAKER: ['李成鹏 软通动力信息技术股份有限公司'],
                                DESC: ['随着大数据、云计算等技术的发展与广泛应用，HPC在行业中的应用也越来越广泛。本次议题将对多款HPC软件到openEuler的跨平台迁移实践进行技术分享。']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: '携手openeuler应对操作系统国产化转型',
                                SPEAKER: ['叶青龙 统信软件'],
                                DESC: ['探讨操作系统国产化转型中的兼容性挑战，并分享统信软件结合迁移工具协助客户解决业务软硬件兼容问题转型欧拉版操作系统。']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: 'SW64自主架构遇上开源欧拉，产业生态兼容的新变革',
                                SPEAKER: ['周元超 普华基础软件'],
                                DESC: ['']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: '欧拉开源社区全球化能力建设与展望',
                                SPEAKER: ['刘鹏 华为'],
                                DESC: ['如何服务好世界各地的开发者，匹配当地的语言、文化、开发习惯和偏好，是openEuler社区深化开源的一大挑战。openEuler G11N SIG，初步探索出了一套全球化理论和方法，并进行了若干全球化实践，希望帮助加快openEuler的全球化的进程。']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: 'oepkgs 开放软件包服务',
                                SPEAKER: ['纪涛 中国科学院软件研究所'],
                                DESC: ['oepkgs 全称开放软件包服务由中国科学院软件研究所、openEuler 社区共同发起并提供支持，旨在为个人开发者、开源社区、OSV、ISV提供免费的软件包、容器镜像的构建、分发和下载服务的第三方平台。', '从使用的角度为大家介绍平台的注册、构建、目标架构的支持、仓库服务、查看日志等流程。', '同时为大家介绍 oepkgs 平台后续会集成的一些功能，例如签名、测试、搜索、集成合规性检查与安全检查等。']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: 'CentOS迁移与操作系统兼容性生态建设',
                                SPEAKER: ['高巍 麒麟软件有限公司'],
                                DESC: ['CentOS替代工作进展、方法及行业案例']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: 'openEuler 兼容性列表建设与实践',
                                SPEAKER: ['李萍  华为'],
                                DESC: ['北向兼容性软件清单来源，覆盖场景']
                            },
                            {
                                TIME: '17:00-17:30',
                                THEME: 'OSV认证体系实践与探索',
                                SPEAKER: ['李君弋 华为'],
                                DESC: ['介绍osv认证方案和认证体系，如何让osv走openEuler的技术路线']
                            },
                        ]
                    },
                    {
                        TITLE: ['Session 4', '安全&可靠性&运维'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: '为数据安全而生，统信软件备份还原工具分享',
                                SPEAKER: ['高冲 统信软件'],
                                DESC: ['统信软件将探讨系统运维中备份与恢复的常用技术方案, 并介绍统信备份还原工具的原理、解决案例以及未来的技术规划。']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: '服务器集中运维管理系统',
                                SPEAKER: ['唐杰 湖南麒麟信安股份有限公司'],
                                DESC: ['支持大批量资产的集中管理，性能监控和告警，日志的集中存储和查询，批量软件升级，批量账户管理，u盘设备管控和安全加固。操作简便，功能强大，提高运维效率。']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: '欧拉开源社区原生运维平台 -- PilotGo',
                                SPEAKER: ['杨昭 麒麟软件有限公司'],
                                DESC: ['PilotGo是openEuler社区原生孵化的运维管理平台，提供大规模集群的主机监控告警、CVE管理、软件包安装升级管理及批量运维操作等功能，保障业务系统安全、稳定运行。同时提供插件机制，对接原有操作系统的多种运维工具，可提供无感知的运维平台切换。']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: '从攻击者角度看Linux内核安全',
                                SPEAKER: ['姚俊/王晓东 360政企安全'],
                                DESC: ['Linux系统在服务器和个人桌面市场有着广泛的使用，作为底层系统，其安全性非常重要。一旦被攻破，商业和个人数据可能被篡改或泄露。本议题以内核中的某个漏洞为案例，除了分析漏洞根因，还会揭秘如何借助该漏洞完成漏洞利用。同时，议题将探讨如何构建更加安全的Linux系统。']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: '基于蓬莱TEE的RISC-V可信机器学习框架',
                                SPEAKER: ['冯二虎 蓬莱TEE'],
                                DESC: ['']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: 'Sec-Anti-SCA基于编译器的CPU侧信道漏洞防护技术',
                                SPEAKER: ['胡科开/吴财军 华为技术有限公司'],
                                DESC: ['自2018年针对处理器cache架构的幽灵和熔断安全漏洞被Google Project Zero曝光以来，新型侧信道漏洞的防护与消减就成为业界热点与难题。业界主流公司如Intel、微软、谷歌等都推出了基于编译器的软硬结合的解决方案，覆盖GCC、LLVM、Visual、C++等主流编译器，典型代表技术有Retpoline、Randpoline等。Gcc-Anti-SCA项目基于GCC编译器提供一个独立安全编译插件，主要针对ARM架构，通过静态代码扫描和模式识别的方式，自动识别源代码中的高风险代码段，并插入ARM架构下相应的安全防护指令。支持ARMv8.5侧信道防护新指令，并向前兼容ARMv8.0及更早的架构。在尽可能多的识别风险点，保证安全性的同时，持续优化，减少误报，把代码性能损失控制在极小的范围内。']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: '操作系统漏洞修复运维探讨',
                                SPEAKER: ['韩永忠  普华基础软件'],
                                DESC: ['对于操作系统安全漏洞已经可实现异常行业检测，漏洞的风险评估以及恶意的程序检测，发现安全隐患后需要等待上游产商给予支持。隐患无法第一时间进行修复。为了解决此问题，操作系统修复的最后一公里：在发现安全隐患后、实现自动获取补丁提交更新计划、提供回退手段形成自动化的运维手段，帮助非云端客户解决本地数据中心的操作系统安全隐患。']
                            },
                            {
                                TIME: '17:00-17:30',
                                THEME: '基于认知技术的openEuler漏洞感知系统',
                                SPEAKER: ['杨牧天 中科微澜'],
                                DESC: ['openEuler开源操作系统作为重要的信息基础设施和生态底座，对自身安全性有很高的要求，为此，我们在openEuler中创新性的引入认知技术，构建openEuler智能化漏洞感知能力。']
                            },
                        ]
                    },
                    {
                        TITLE: ['Session 5', '分布式&多样性计算'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: '仿真软件弹性计算',
                                SPEAKER: ['王松松 哈尔滨工业大学'],
                                DESC: ['大型仿真软件运行时多需要长时间并发运行，遇到某个计算节点挂掉后容易前功尽弃，因此发展弹性计算十分重要']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: 'Arm64上开源分布式存储系统的生态进展',
                                SPEAKER: ['赵帅、刘新良 Linaro'],
                                DESC: ['在Arm64企业市场中，由于其多核并行计算和高性能IO的优势，使得Arm64在分布式存储领域拥有了使用场景。然而软件生态方面，Arm64依然有很长的路要走，不仅仅在于软件使能，项目CI，同时还需要针对相关场景的性能优化。Linaro和会员共同努力，致力于推动分布式存储系统的软件开发和生态进步。目前，我们已经在分布式存储系统，加速库，HPC文件系统等领域取得了一些进展。我们的工作主要基于对项目的使能，CI支持以及针对成熟系统在Arm64上的性能优化，同时也涉及了一些在openEuler上针对HPC文件系统的使能和验证。在本次分享中，我们将详细介绍盖Ceph，Rook, Lustre等项目的Arm CI进展，HPC文件系统的Arm支持以及在OpenEuler中使能和验证，以及利用PMDK等加速库对分布式存储系统进行优化的工作。']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: '华为元戎-分布式多样性算力的理念和探索',
                                SPEAKER: ['梁义 华为'],
                                DESC: ['']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: '欧拉开源社区GCC优化特性介绍及前瞻',
                                SPEAKER: ['马明泽 华为'],
                                DESC: ['']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: '构建openEuler的分布式能力',
                                SPEAKER: ['孙宏伟 华为'],
                                DESC: ['']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: 'CirroData分布式数据库发展方向和工程实践',
                                SPEAKER: ['董山 东方国信'],
                                DESC: ['（1）企业级分布式架构发展方向', '（2）创新技术及在华为平台的工程实践', '（3）技术展望']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: '飞腾平台基础算法优化',
                                SPEAKER: ['阳柳  飞腾信息技术有限公司'],
                                DESC: ['芯片是骨，软件是魂。高水平应用软件是提升飞腾平台的重要手段之一，而高性能的基础算法库是编写高水平应用软件的基础。本议题围绕飞腾软件生态的发展规划，紧密结合用户需求，探讨基础算法优化过程中的经验和收获。']
                            },
                            {
                                TIME: '17:00-17:30',
                                THEME: 'openEuler 容器 OS升级介绍',
                                SPEAKER: ['李元戎 华为'],
                                DESC: ['']
                            },
                            {
                                TIME: '17:30-18:00',
                                THEME: '霄瀚全场景操作系统实践和应用',
                                SPEAKER: ['解伟俊  拓维'],
                                DESC: ['']
                            },
                        ]
                    },
                    {
                        TITLE: ['Session 6', '边缘&嵌入式'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: '欧拉开源操作系统嵌入式方向的发展规划',
                                SPEAKER: ['林子畅 华为技术有限公司'],
                                DESC: ['介绍openEuler在嵌入式方向，与之前服务器领域的异同点，后续可能的特性、功能规划']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: '面向嵌入式场景的构建系统Yocto应用与思考',
                                SPEAKER: ['任慰 华为技术有限公司'],
                                DESC: ['当前openEuler的构建系统OBS主要是面向服务器场景的，对于嵌入式场景支持并不好，例如不支持交叉编译，裁剪的力度有限等。为了使openeuler的相关成果能够延伸到嵌入式领域，我们引入了面向嵌入式场景的构建系统Yocto。本议题将分享Yocto的基本情况、如何基于Yocto构建openEuler embedded、存在的问题与挑战以及面向未来的一些思考和规划']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: '推动RISC-V软件生态及openEuler在VisionFive开发板的适配',
                                SPEAKER: ['朱潇潇 赛昉科技'],
                                DESC: ['']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: 'RV64 异构多核处理器下实现RT-Thread和openeuler同时运行',
                                SPEAKER: ['张海涛 RT-thread'],
                                DESC: ['']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: '云原生边缘计算平台架构与实践',
                                SPEAKER: ['王杰章 华为'],
                                DESC: ['现如今边缘计算的应用场景非常丰富，而且面临着诸多挑战，例如：边云通信网络质量低、边缘资源受限、边缘应用离线自治和本地故障恢复、边缘节点高度分散和资源异构。针对上述问题，我们提出了云原生边缘计算平台的架构与实践——KubeEdge，并配套边缘分布式网络组件EdgeMesh与边缘协调AI框架Sedna。']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: '云边协同在太空卫星上的实践探索',
                                SPEAKER: ['林培峰  SUSE'],
                                DESC: ['本议题通过实际的案例分享，探索云边协同技术如何在太空卫星上落地，如何利用云原生、DevSecOpt和边缘技术更好的在太空卫星上使用更低成本硬件，构建更安全可靠软件，实现在太空卫星上更可靠更新软件，以及更好实现AI/ML计算。']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: 'Linux实时性实践与探索',
                                SPEAKER: ['郭皓 麒麟软件'],
                                DESC: ['基于openeuler做的Linux实时性探索和研究，已发布Linux嵌入式操作系统demo，支持飞腾、鲲鹏、x86平台']
                            },
                        ]
                    }
                ]
            },
        },
        NAV_LIST: [
            {
                key: '#live',
                name: '精彩回顾'
            },
            {
                key: '#agenda',
                name: '峰会日程'
            },
            {
                key: '#exhibition',
                name: '线上展厅'
            },
            {
                key: '#lecturer',
                name: '演讲嘉宾'
            },
            {
                key: '#publisher',
                name: '出品人'
            },
            {
                key: '#construction',
                name: '共建单位'
            }
        ],
        CONSTRUCTION: {
            WEB_TITLE: "/img/summit/summit2021/Co-construction/web-title.png",
            MOBILE_TITLE: "/img/summit/summit2021/Co-construction/mobile-title.png",
            GUIDANCE: {
                TEXT_TITLE: "指导单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/openaton.png",
                        LINK: ""
                    }
                ]
            },
            HOST: {
                TEXT_TITLE: "主办单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/openEulerlogo.png",
                        LINK: ""
                    }
                ]
            },
            STRATEGIC: {
                TEXT_TITLE: "战略合作单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/huawei.png",
                        LINK: ""
                    }
                ]
            },
            CO_SPONSORED: {
                TEXT_TITLE: "联合主办单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/qilinsoft.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/qilinxinan.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/suse.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/tongxin.png",
                        LINK: ""
                    }
                ]

            },
            CO_ORGANIZER: {
                TEXT_TITLE: "协办单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/yidong.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/dianxing.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/liantong.png",
                        LINK: ""
                    },               
                    {
                        IMG: "/img/summit/summit2021/Co-construction/puhua.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/turbolinux.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/phytium.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/shentai.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/softstone.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/easystack.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/360.png",
                        LINK: ""
                    },  
                    {
                        IMG: "/img/summit/summit2021/Co-construction/dongfangtong.png",
                        LINK: ""
                    },                                 
                ]
            },
            SUPPORT: {
                TEXT_TITLE: "支持单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/jdcloud.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/xinlang.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/kengpeng.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/zhongkedachuang.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/tianyuan.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/bessystem.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/qingcloud.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/starfive.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/winhong.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/asiainfo.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/nuclei.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/xsky.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/guoxing.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/iiioka.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/isstech.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/huayun.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/kaifazhineng.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/iscas.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/ruihe.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/langcher.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/xinchen.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/youxi.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/beilian.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/talkweb.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/shenzhou.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/huanghe.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/baixing.png",
                        LINK: ""
                    },
                ]
            },
            FOUNDATION: {
                TEXT_TITLE: "友好基金会",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/linux.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/openinfra.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/linaro.png",
                        LINK: ""
                    },
                ]
            }
        },
        LECTURER: {
            LECTURER_BANNER: {
                web: '/img/summit/summit2021/lecturer/sperkertitle.png',
                mobile: '/img/summit/summit2021/lecturer/sperkertitle_mo.png'
            },
            LECTURER_LIST: [
                {
                    IMG: '/img/summit/summit2021/lecturer/yangtao.png',
                    NAME: '杨涛',
                    POSITION: '开放原子开源基金会 理事长'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/jiangdayong.png',
                    NAME: '江大勇',
                    POSITION: '欧拉开源社区理事长'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/wuyanjun.png',
                    NAME: '武延军',
                    POSITION: '欧拉开源社区副理事长'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/qiuchengfeng.png',
                    NAME: '邱成锋',
                    POSITION: '欧拉开源社区秘书长'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/huxinwei.png',
                    NAME: '胡欣蔚',
                    POSITION: '欧拉开源社区 技术委员会主席'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/chenhaibo.png',
                    NAME: '陈海波',
                    POSITION: '上海交通大学教授 华为操作系统首席科学家'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/gaowei.png',
                    NAME: '高巍',
                    POSITION: '欧拉开源社区 用户委员会主席'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/qinxiaokang.png',
                    NAME: '秦小康',
                    POSITION: 'SUSE大中华区总裁'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/wangpan.png',
                    NAME: '王攀',
                    POSITION: '麒麟信安副总裁'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/zhanglei.png',
                    NAME: '张磊',
                    POSITION: '统信软件CTO'
                },
            ],
            PUBLISHER_BANNER: {
                web: '/img/summit/summit2021/lecturer/publishertitle.png',
                mobile: '/img/summit/summit2021/lecturer/publishertitle_mo.png'
            },
            PUBLISHER_LIST: [
                {
                    IMG: '/img/summit/summit2021/lecturer/guohanjun.png',
                    NAME: '郭寒军',
                    POSITION: '欧拉开源社区内核 Maintainer'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/liyong.png',
                    NAME: '李勇',
                    POSITION: 'SUSE软件工程顾问'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/yixiujiang.png',
                    NAME: '尹秀江',
                    POSITION: '麒麟软件工程师'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/yanshuanghai.png',
                    NAME: '严海双',
                    POSITION: '中移云能力中心 内核研发专家'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/shenxiang.png',
                    NAME: '沈翔',
                    POSITION: '普华基础软件总经理'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/dukaitian.png',
                    NAME: '杜开田',
                    POSITION: '欧拉开源社区 兼容性SIG组Maintainer'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/yeqinglong.png',
                    NAME: '叶青龙',
                    POSITION: '服务器操作系统项目总监 欧拉开源社区 技术委员会委员'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/liujingang.png',
                    NAME: '刘金刚',
                    POSITION: '欧拉开源社区 技术委员会委员'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/caihaomin.png',
                    NAME: '蔡灏旻',
                    POSITION: '华为容器团队架构师'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/shiyong.png',
                    NAME: '石勇',
                    POSITION: '欧拉开源社区 技术委员会委员'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/panjianfeng.png',
                    NAME: '潘剑锋',
                    POSITION: '360集团副总裁 首席科学家'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/yangliu.png',
                    NAME: '阳柳',
                    POSITION: '飞腾资深软件架构师'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/xiekunxun.png',
                    NAME: '谢焜勋',
                    POSITION: '华为嵌入式操作系统 技术专家'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/lishouyong.png',
                    NAME: '刘寿永',
                    POSITION: ' 中科创达首席架构师'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/chenjingwei.png',
                    NAME: '陈景伟',
                    POSITION: ' 赛昉生态市场高级总监'
                },
            ]
        },
        HIGHLIGHTS: "精彩回顾",
    },
    en: {
        SUMMIT_BANNER: {
            MOBILE_IMG: "https://openeuler-website-beijing.obs.cn-north-4.myhuaweicloud.com/openEuler-summit-2021/images/%E6%AC%A7%E6%8B%89-375x300-%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F%E9%A6%96%E9%A1%B5.png",
            PC_IMG: "https://openeuler-website-beijing.obs.cn-north-4.myhuaweicloud.com/openEuler-summit-2021/images/1920x380%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F.png"
        },
        LIVETITLE: '操作系统产业峰会生态伙伴直播间',
        TEN_TITLE:'openEuler Summit 2021 直播间',
        PC_LIVEIMG: '/img/summit/home/zh-pc-liveroom.png',
        MOBILE_LIVEIMG: '/img/summit/home/zh-mobile-liveroom.png',
        SUMMITLIVE: {
           NINE :[
            {
                ID: 9862,
                THEME: '操作系统产业峰会2021',
                TIME: '09:30-11:30',
                OPTION: '09:30-11:30 操作系统产业峰会2021',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9862?lang=zh&thirdId='
            },
            {
                ID: 9863,
                THEME: '麒麟软件',
                TIME: '14:00-16:40',
                OPTION: '14:00-16:40 麒麟软件',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9863?lang=zh&thirdId='
            },
            {
                ID: 9900,
                THEME: '麒麟信安',
                TIME: '14:00-16:40',
                OPTION: '14:00-16:40 麒麟信安',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9900?lang=zh&thirdId='
            },
            {
                ID: 9901,
                THEME: '统信',
                TIME: '14:00-17:00',
                OPTION: '14:00-17:00 统信',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9901?lang=zh&thirdId='
            },
            {
                ID: 9864,
                THEME: '中科创达',
                TIME: '14:00-16:40',
                OPTION: '14:00-16:40 中科创达',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9864?lang=zh&thirdId='
            },
            {
                ID: 9865,
                THEME: '普华基础软件',
                TIME: '14:00-16:30 ',
                OPTION: '14:00-16:30 普华基础软件',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9865?lang=zh&thirdId='
            },
           ],
           TEN : [
            {
                ID: 9866,
                THEME: 'openEuler Summit 2021',
                TIME: '9:30-11:55 ',
                OPTION: '9:30-11:55 openEuler Summit 2021',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9866?lang=zh&thirdId='
            },
            {
                ID: 9867,
                THEME: '内核',
                TIME: '13:00-17:30 ',
                OPTION: '13:00-17:30 内核分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9867?lang=zh&thirdId='
            },
            {
                ID: 9868,
                THEME: '云&虚拟化',
                TIME: '13:00-18:00 ',
                OPTION: '13:00-18:00 云&虚拟化分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9868?lang=zh&thirdId='
            },
            {
                ID: 9869,
                THEME: '兼容性',
                TIME: '13:00-17:30 ',
                OPTION: '13:00-17:30 兼容性分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9869?lang=zh&thirdId='
            },
            {
                ID: 9870,
                THEME: '安全&可靠性&运维',
                TIME: '13:00-17:30 ',
                OPTION: '13:00-17:30 安全&可靠性&运维分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9870?lang=zh&thirdId='
            },
            {
                ID: 9871,
                THEME: '分布式&多样性计算',
                TIME: '13:00-18:00 ',
                OPTION: '13:00-17:30 分布式&多样性计算分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9871?lang=zh&thirdId='
            },
            {
                ID: 9872,
                THEME: '边缘&嵌入式',
                TIME: '13:00-17:30 ',
                OPTION: '13:00-17:30 边缘&嵌入式分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9872?lang=zh&thirdId='
            },
           ]
        },
        AGENDA: {
            WEB_TITLE: '/img/summit/summit2021/zh-pc-summit2021.png',
            MOBILE_TITLE: '/img/summit/summit2021/zh-mobile-summit2021.png',
            DATE: ['11月09日', '11月10日', '上午', '下午'],
            SUB_FORUM: '操作系统产业峰会生态伙伴分论坛',
            FORUM_HEAD: ['麒麟软件', '麒麟信安', 'SUSE', '统信软件', '中科创达', '普华基础软件'],
            FORENOON_AGENDA_9: [
                {
                    TIME: '09:30 - 09:45',
                    THEME: '开场致辞',
                    SPEAKER: '神秘嘉宾',
                },
                {
                    TIME: '09:45 - 10:00',
                    THEME: '欧拉开源操作系统重大发布',
                },
                {
                    TIME: '10:00 - 10:10',
                    THEME: '操作系统发展展望',
                    SPEAKER: '中国工程院院士',
                },
                {
                    TIME: '10:10 - 10:20',
                    THEME: '立根铸魂，共建操作系统新生态',
                    SPEAKER: '华为',
                },
                {
                    TIME: '10:20 - 10:25',
                    THEME: '操作系统产业宣誓',
                },
                {
                    TIME: '10:25 - 10:55',
                    THEME: '行业用户实践分享',
                    SPEAKER: '运营商、金融等行业重磅嘉宾'
                },
                {
                    TIME: '10:55 - 11:05',
                    THEME: '携手欧拉开源创新，服务中国数字时代',
                    SPEAKER: '麒麟软件',
                },
                {
                    TIME: '11:05 - 11:15',
                    THEME: '扎根开源生态，服务中国企业，帮助中国开源系统走向世界',
                    SPEAKER: 'SUSE',
                },
                {
                    TIME: '11:15 - 11:20',
                    THEME: '欧拉生态创新中心发布',
                },
                {
                    TIME: '11:20 - 11:30',
                    THEME: '智能基座 · 欧拉人才发展加速计划发布',
                },
            ],
            FORENOON_AGENDA_10: [
                {
                    TIME: '09:30 - 09:35',
                    THEME: '欢迎致辞',
                    SPEAKER: '杨涛',
                    POSITION: '开放原子开源基金会理事长'
                },
                {
                    TIME: '09:35 - 09:45',
                    THEME: '凝聚创新力量 逐梦数字时代星辰大海',
                    SPEAKER: '江大勇',
                    POSITION: '欧拉开源社区理事长'
                },
                {
                    TIME: '09:45 - 09:50',
                    THEME: '欧拉开源社区理事会升级仪式',
                    SPEAKER: '邱成锋',
                    POSITION: '欧拉开源社区秘书长'
                },
                {
                    TIME: '09:50 - 09:55',
                    THEME: '欧拉开源社区技术委员会换届升级仪式',
                    SPEAKER: '邱成锋',
                    POSITION: '欧拉开源社区秘书长'
                },
                {
                    TIME: '09:55 - 10:10',
                    THEME: '全场景欧拉 - 唯有无边界开放才能无止境增长',
                    SPEAKER: '胡欣蔚',
                    POSITION: '欧拉开源社区技术委员会主席'
                },
                {
                    TIME: '10:10 - 10:40',
                    THEME: 'openEuler&Friends 2.0-协作联创激发无限可能',
                    SPEAKER: '中国电信、中国移动、中国联通、中科创达、华为、品高软件'
                },
                {
                    TIME: '10:40 - 10:55',
                    THEME: '中国银行操作系统创新实践',
                    SPEAKER: '中国银行和麒麟软件联合演讲',
                },
                {
                    TIME: '10:55 - 11:10',
                    THEME: '中国移动云原生生态创新实践',
                    SPEAKER: '中国移动和SUSE联合演讲',
                },
                {
                    TIME: '11:10 - 11:25',
                    THEME: '国家电网调度控制系统创新实践',
                    SPEAKER: '中国电科院和麒麟信安联合演讲'
                },
                {
                    TIME: '11:25 - 11:40',
                    THEME: '中国邮政业务应用创新实践',
                    SPEAKER: '中国邮政和统信软件联合演讲',
                },
                {
                    TIME: '11:40 - 11:50',
                    THEME: '仰望星空-操作系统演讲与前沿发展思考',
                    SPEAKER: '陈海波',
                    POSITION: '上海交通大学教授 、华为操作系统首席科学家'
                },
                {
                    TIME: '11:50 - 11:55',
                    THEME: '欧拉开源社区超级用户大奖',
                    SPEAKER: '高巍',
                    POSITION: '欧拉开源社区用户委员会主席'
                }
            ],
            AFTERNOON_AGENDA_9: [
                // 麒麟软件
                [
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '领导致辞',
                        SPEAKER: '华为领导'
                    },
                    {
                        TIME: '14:10 - 14:25',
                        THEME: '合作共赢，生态共生',
                        SPEAKER: '孔金珠',
                        POSITION: '麒麟软件 高级副总经理'
                    },
                    {
                        TIME: '14:25 - 14:40',
                        THEME: '开源新时代-麒麟软件积极拥抱开源社区',
                        SPEAKER: '侯健',
                        POSITION: '麒麟软件 服务器研发部技术总监'
                    },
                    {
                        TIME: '14:40 - 14:55',
                        THEME: '中国联通自主操作系统实践经验分享',
                        SPEAKER: '肖微',
                        POSITION: '联通软研院'
                    },
                    {
                        TIME: '14:55 - 15:00',
                        THEME: '麒麟鲲鹏联合创新实验室揭牌',
                        SPEAKER: '刘海涛、高巍',
                    },
                    {
                        TIME: '15:00 - 15:10',
                        THEME: '北京鲲鹏联合创新中心领导致辞',
                        SPEAKER: '刘海涛',
                        POSITION: '北京鲲鹏联合创新中心 首席运营官'
                    },
                    {
                        TIME: '15:10 - 15:15',
                        THEME: '麒麟创客北京·鲲鹏应用创新大赛2021颁奖仪式',
                        SPEAKER: '麒麟软件、华为领导'
                    },
                    {
                        TIME: '15:15 - 15:25',
                        THEME: '幸运抽奖 &茶歇',
                    },
                    {
                        TIME: '15:25 - 15:40',
                        THEME: '开放联合，共建软件生态',
                        SPEAKER: '刘勇鹏',
                        POSITION: '飞腾 副总裁、软件技术方案中心总经理'
                    },
                    {
                        TIME: '15:40 - 15:55',
                        THEME: '护航国产操作系统 打造安全计算环境',
                        SPEAKER: '李栋',
                        POSITION: '奇安信 椒图事业部副总经理'
                    },
                    {
                        TIME: '15:55 - 16:10',
                        THEME: '价值驱动国产基础软硬件协同发展 ',
                        SPEAKER: '王容多',
                        POSITION: '同方 战略生态中心总经理 / 行业销售中心总经理'
                    },
                    {
                        TIME: '16:10 - 16:25',
                        THEME: '携手打造基础软件根技术，助力用户创造更大价值 ',
                        SPEAKER: '肖枫',
                        POSITION: '海量数据 总裁'
                    },
                    {
                        TIME: '16:25 - 16:40',
                        THEME: '国产数据库与操作系统的合作',
                        SPEAKER: '宋瑞',
                        POSITION: '人大金仓 高级副总裁'
                    },
                    {
                        TIME: '16:40 - 16:55',
                        THEME: '国产中间件创新与应用',
                        SPEAKER: '谢耘',
                        POSITION: '东方通 首席科学家'
                    },
                    {
                        TIME: '16:55 - 17:10',
                        THEME: '基于麒麟V10的分布式中间件新核心',
                        SPEAKER: '成勇斌',
                        POSITION: '金蝶天燕 副总经理'
                    },
                    {
                        TIME: '17:10 - 17:20',
                        THEME: '幸运抽奖',
                    },
                ],
                // 麒麟信安
                [
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '欢迎致辞',
                        SPEAKER: '麒麟信安领导、华为领导',
                    },
                    {
                        TIME: '14:10 - 14:25',
                        THEME: 'openEuler技术分享',
                        SPEAKER: '欧拉开源社区技术专家'
                    },
                    {
                        TIME: '14:25 - 14:40',
                        THEME: '根植欧拉开源社区构建麒麟信安操作系统',
                        SPEAKER: '陈松政',
                        POSITION: '麒麟信安高级副总裁'
                    },
                    {
                        TIME: '14:40 - 14:50',
                        THEME: '欢乐抽奖',
                    },
                    {
                        TIME: '14:50 - 15:05',
                        THEME: '麒麟信安操作系统的工控属性',
                        SPEAKER: '石勇',
                        POSITION: '麒麟信安操作系统产品总监'
                    },
                    {
                        TIME: '15:05 - 15:20',
                        THEME: '麒麟信安操作系统的云原生属性',
                        SPEAKER: '孙利杰',
                        POSITION: '麒麟信安操作系统、云计算产品线研发总监'
                    },
                    {
                        TIME: '15:20 - 15:30',
                        THEME: '联合实验室揭牌仪式',
                    },
                    {
                        TIME: '15:30 - 15:40',
                        THEME: '欢乐抽奖',
                    },
                    {
                        TIME: '15:40 - 15:55',
                        THEME: 'CentOS停服后国产操作系统的蓝海商机 ',
                        SPEAKER: '任启',
                        POSITION: '麒麟信安高级副总裁'
                    },
                    {
                        TIME: '15:55 - 16:10',
                        THEME: '麒麟信安操作系统在电力调度和航天测发控核心系统创新应用实践',
                        SPEAKER: '王攀',
                        POSITION: '麒麟信安副总裁'
                    },
                    {
                        TIME: '16:10 - 16:30',
                        THEME: '圆桌论坛 ',
                        SPEAKER: '合作伙伴'
                    },
                    {
                        TIME: '16:30 - 16:40',
                        THEME: '欢乐抽奖、结束',
                    },
                ],
                // SUSE
                [
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '数硕Linux的定位与发展',
                        SPEAKER: '江永清',
                        POSITION: 'SUSE 大中华区董事长'
                    },
                    {
                        TIME: '14:10 - 14:20',
                        THEME: '欧拉开源社区支持服务发布仪式',
                        SPEAKER: '江永清',
                        POSITION: 'SUSE 大中华区董事长',
                        SPEAKER2: '陈伟',
                        POSITION2: 'SUSE 大中华区Service Director'
                    },
                    {
                        TIME: '14:20 - 14:40',
                        THEME: '欧拉开源社区支持服务',
                        SPEAKER: '陈伟',
                        POSITION: 'SUSE 大中华区Service Director'
                    },
                    {
                        TIME: '14:40 - 15:10',
                        THEME: '数硕Linux技术展望',
                        SPEAKER: '刘恺',
                        POSITION: 'SUSE Euler PD Manager'
                    },
                    {
                        TIME: '15:10 - 15:25',
                        THEME: '茶歇',
                    },
                    {
                        TIME: '15:25 - 15:55',
                        THEME: 'Rancher + iSulad解决方案',
                        SPEAKER: '江鹏',
                        POSITION: 'SUSE 大中华区技术总监'
                    },
                    {
                        TIME: '15:55 - 16:25',
                        THEME: '助力国产硬件，构建自主可控业务生态',
                        SPEAKER: '于明',
                        POSITION: '长城信息股份有限公司副总裁，人工智能所所长'
                    },
                    {
                        TIME: '16:25 - 16:55',
                        THEME: '云原生安全架构的应用实践',
                        SPEAKER: '刘玮',
                        POSITION: '上海缔赛信息技术有限公司总经理'
                    },
                    {
                        TIME: '16:55 - 17:10',
                        THEME: '观众互动',
                        SPEAKER: '现场主持',
                    },
                ],
                // 统信软件
                [
                    {
                        TIME: '13:30 - 14:00',
                        THEME: '签到入场',
                    },
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '欢迎致辞',
                        SPEAKER: '朱建忠',
                        POSITION: '统信软件 高级副总裁'
                    },
                    {
                        TIME: '14:10 - 14:40',
                        THEME: '打造数字时代新底座——统信服务器操作系统',
                        SPEAKER: '孟杰',
                        POSITION: '统信软件 服务器OS产线副总经理'
                    },
                    {
                        TIME: '14:40 - 15:10',
                        THEME: '打造统信UOS操作系统新生态',
                        SPEAKER: '张木梁',
                        POSITION: '统信软件 生态中心副总经理'
                    },
                    {
                        TIME: '15:10 - 15:40',
                        THEME: 'openEuler 技术分享',
                        SPEAKER: 'openEuler 技术专家',
                    },
                    {
                        TIME: '15:40 - 15:50',
                        THEME: '茶歇',
                    },
                    {
                        TIME: '15:50 - 16:05',
                        THEME: '共建生态、合作共赢',
                        SPEAKER: '邓忠良',
                        POSITION: '同方计算机产业本部副总经理'
                    },
                    {
                        TIME: '16:05 - 16:20',
                        THEME: '数据相联，探索价值',
                        SPEAKER: '莫良伟',
                        POSITION: '宝德 软件部总监'
                    },
                    {
                        TIME: '16:20 - 16:35',
                        THEME: '万亿级湖仓一体架构下的统一数据服务平台应用实践',
                        SPEAKER: '陈元熹 ',
                        POSITION: '巨杉数据库',
                        POSITION2: '研发资深总监',
                        POSITION3: '首席架构师'
                    },
                    {
                        TIME: '16:35 - 16:50',
                        THEME: '协同办公系统信创实践与探索',
                        SPEAKER: '杨竹君 ',
                        POSITION: '泛微 政务副总经理'
                    },
                    {
                        TIME: '16:50 - 17:05',
                        THEME: '信创数据交换平台最佳实践 ',
                        SPEAKER: '臧一超 ',
                        POSITION: '普元信息 数智研究院 副总经理'
                    },
                    {
                        TIME: '17:05 - 17:20',
                        THEME: '融合信创生态，打造安全高效的地理信息系统',
                        SPEAKER: '周丹',
                        POSITION: '中地数码 北京副总经理'
                    },
                    {
                        TIME: '17:20 - 17:30',
                        THEME: '抽奖环节',
                    },
                ],
                // 中科达创
                [
                    {
                        TIME: '13:30 - 14:00',
                        THEME: '签到入场',
                    },
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '主持人开场',
                        SPEAKER: '刘寿永',
                        POSITION: '中科创达首席架构师'
                    },
                    {
                        TIME: '14:10 - 14:30',
                        THEME: '云原生边缘计算平台架构与实践',
                        SPEAKER: '王杰章',
                        POSITION: '华为云原生高级工程师'
                    },
                    {
                        TIME: '14:30 - 14:50',
                        THEME: '浅析边缘计算中间件',
                        SPEAKER: '徐晓晶',
                        POSITION: '中科创达软件架构师'
                    },
                    {
                        TIME: '14:50 - 15:10',
                        THEME: 'Intel 边缘软件中心介绍',
                        SPEAKER: '冯伟',
                        POSITION: 'Intel边缘计算架构师'
                    },
                    {
                        TIME: '15:10 - 15:20',
                        THEME: '茶歇 & 交流',
                    },
                    {
                        TIME: '15:20 - 15:40',
                        THEME: '端侧边缘计算赋能千行百业',
                        SPEAKER: '朱勇',
                        POSITION: '中科创达AI技术中心负责人'
                    },
                    {
                        TIME: '15:40 - 16:00',
                        THEME: 'EdgeX加速边缘原生应用',
                        SPEAKER: '路广',
                        POSITION: 'VMWare 中国研发总监'
                    },
                    {
                        TIME: '16:00 - 16:20',
                        THEME: '融合发展助力智能汽车产业腾飞',
                        SPEAKER: '王志杰',
                        POSITION: '中科创达智能汽车SOA产品经理'
                    },
                    {
                        TIME: '16:20 - 16:40',
                        THEME: '双碳背景下的边缘计算和虚拟电厂',
                        SPEAKER: '樊小毅',
                        POSITION: '江行智能CTO'
                    },
                ],
                // 普华基础软件
                [
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '致词',
                        SPEAKER: '华为领导'
                    },
                    {
                        TIME: '14:10 - 14:30',
                        THEME: '开场发言',
                        SPEAKER: '沈翔',
                        POSITION: '普华基础软件事业部总经理'
                    },
                    {
                        TIME: '14:30 - 15:00',
                        THEME: '基于欧拉开源操作系统软硬件新品发布',
                        SPEAKER: '董自强',
                        POSITION: '普华基础软件产品部总经理'
                    },
                    {
                        TIME: '15:00 - 15:20',
                        THEME: '茶歇 & 抽奖环节',
                    },
                    {
                        TIME: '15:20 - 15:50',
                        THEME: '圆桌论坛：多样性算力、业务模式创新模式影响下，操作系统产业未来发展',
                    },
                    {
                        TIME: '15:50 - 16:10',
                        THEME: '深耕基础软件根技术，普华的铸魂之路',
                        SPEAKER: '王伶卓',
                        POSITION: '普华基础软件事业部技术副总'
                    },
                    {
                        TIME: '16:10 - 16:30',
                        THEME: '聚焦行业，普华基础软件多场景应用分享',
                        SPEAKER: '王江涛',
                        POSITION: '普华基础软件高级安全专家'
                    },
                    {
                        TIME: '16:30 - 16:50',
                        THEME: '欢乐抽奖、结束',
                    },
                ],
            ],
            AFTERNOON_AGENDA_10: {
                TIME_LIST: ['13:00-13:30', '13:30-14:00', '14:00-14:30', '14:30-15:00', '15:00-15:30', '15:30-16:00', '16:00-16:30', '16:30-17:00', '17:00-17:30', '17:30-18:00'],
                CARD_LIST: [
                    {
                        TITLE: ['Session 1', '内核'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: '网络新技术MPTCP原理，协议和应用',
                                SPEAKER: ['唐葛亮 SUSE Linux'],
                                DESC: ['介绍网络新技术MPTCP(Multipath TCP)原理和协议，以及当前MPTCP upstream社区的状态，最后和大家讨论MPTCP相关应该场景。']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: '内核热升级技术的应用实践',
                                SPEAKER: ['尹秀江 麒麟软件有限公司', '何静娴 华为'],
                                DESC: ['内核热升级是openEuler社区原生孵化的一项技术，为解决内核CVE漏洞和减少系统宕机时间提供了有利保障，本次议题主要介绍内核热升级技术及分享在麒麟系统上的实践经验']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: '内存分级扩展在天翼云上的实践',
                                SPEAKER: ['张俊平 天翼云科技公司'],
                                DESC: ['使用傲腾内存，虚拟机内存超配，提升内存性价比，提升虚拟机性能']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: 'RISC-V Linux 异构多核架构实现与挑战',
                                SPEAKER: ['Tan Ley Foon 赛昉'],
                                DESC: ['一． 介绍异构多核架构', '二． 介绍Linux 内核对异构多核架构的支持: Energy Awareness Scheduling (EAS) and Capacity Awareness Scheduling (CAS)', '三． RISC-V架构对于异构多核架构的实现与挑战']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: 'Bond 3+高可靠冗余通信解决方案',
                                SPEAKER: ['秦云高 湖南麒麟信安科技股份有限公司'],
                                DESC: ['高可靠性网络通信在国家电网、金融、航天领域的应用中至关重要。', '本方案通过增强Linux内核bond 3广播模式，', '1. 实现UDP零重包，网络故障时自动链路切换的可靠冗余通信。', '2. 实现TCP网络故障时零延时最高可靠冗余通信。']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: '虚拟化技术在SW64自主架构的探索与实践',
                                SPEAKER: ['张毅 中电科申泰信息科技有限公司'],
                                DESC: ['1. Cpu虚拟化在申威架构上的探索与实践：接轨主流，实现了申威架构下的kvm；优化了申威架构下的中断虚拟化（时钟中断、核间中断），明显提高了中断性能。', '2. 内存虚拟化在申威架构上的探索与实践：设计了一种有别于x86架构实现的影子页表机制，该机制充分利用了申威架构的特点。并把它实现，内存虚拟化（影子页表）的相对开销数据优于x86。', '3. IO虚拟化在申威架构上的探索与实践：设计并实现了申威架构下VFIO与IOMMU：以新的驱动方式代替设备原有驱动；实现了申威架构下二级页表映射，并且实现8k和8M的页面粒度支持；以一种新的地址方式来替代真实的物理地址以增强内存的连续性和安全性。目前支持千兆、万兆网卡的设备直通。']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: '内核和进程热补丁技术的实现与应用',
                                SPEAKER: ['唐彬  中国移动云能力中心'],
                                DESC: ['在日常生产过程中，经常会遇到bug或者cve等问题需要升级内核，而当前升级内核需要重启系统，这会影响业务的连续性，为了最大限度避免重启服务器，采用热补丁的方式来修复内核bug或者cve漏洞，本主题主要介绍x86与arm64架构下的内核热补丁技术实现与应用']
                            },
                            {
                                TIME: '17:00-17:30',
                                THEME: '支持多任务的共享虚拟内存池技术',
                                SPEAKER: ['丁天虹 华为技术有限公司'],
                                DESC: ['Linux的多任务间的共享内存对SPA（Share Physiacl Address）支持比较完善，但是在支持SVA（Share Virtual Address）上使用并不方便，任务间如果要获取统一的虚拟地址，需要独立实现地址分配和管理的框架，我们在内核实现了一致性内存管理技术（Share Pool），主要解决CPU多任务之间共享虚拟地址的问题，可以较为方便的为多应用提供统一虚拟地址，该技术适合Linux在AI计算等应用场景的使用']
                            },
                        ]
                    },
                    {
                        TITLE: ['Session 2', '云&虚拟化'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: '不同Arm厂商的CPU互相模拟',
                                SPEAKER: ['仇大玉 华云数据控股集团有限公司'],
                                DESC: ['在公有云或者专属云内，很多时候CPU架构是相通的但是厂商却不一样，尤其在ARM服务器中，默认都是host虚拟化模式，无法屏蔽底层硬件差异，除全软件模拟的方式，但是性能损耗严重，本次topic就如何实现屏蔽底层差异的硬件虚拟化方式下，实现不同ARM Vendor 的CPU互相模拟']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: 'Capsule：全场景统一的新一代 Hypervisor',
                                SPEAKER: ['吴斌 华为'],
                                DESC: ['Capsule是完全由openEuler社区控制的新型Hypervisor项目。类似KVM，Capsule充分使能不同CPU体系的硬件辅助虚拟化能力。不同的是，Capsule采用Rust语言编写以带来更大的安全性。另外，Capsule重塑了Hypervisor架构，使它既可以支持普通虚拟机(满足多种多样的企业应用)，也可以支持安全容器(满足容器化负载应用)，同时还可以支持逻辑分区(满足实时类应用)，真正做到统一各类生态，支持IT/CT/OT全场景应用。']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: '基于欧拉开源操作系统的云底座操作系统NestOS',
                                SPEAKER: ['杜奕威 麒麟软件有限公司'],
                                DESC: ['NestOS是在openEuler社区孵化的云底座操作系统，搭载isulad，podman，docker等主流容器基础平台，可以适应各种不同的基础设施环境，使系统具备十分便捷的集群组建能力，与OKD紧密集成。同时NestOS可以安全的进行系统升级与回滚，可用于大规模下安全的运行容器化工作负载。']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: '摄像头虚拟化',
                                SPEAKER: ['夏华 湖南麒麟信安科技股份有限公司'],
                                DESC: ['桌面云行业，通常使用usbredir作为核心技术进行usb类设备的重定向。但实际场景中，诸如usbvideo类设备，由于其过于庞大的数据流交互，收带宽限制，在云桌面场景下，使用起来非常困难。为了应对该场景，我们采用了最新的XX方案进行摄像头重定向，其根本原理在于，把交互数据的图像数据部分进行压缩，在usbredir的客户端（设备使用端）和服务端（设备接入端）两段，分别布置插件。在服务端，针对性识别出图像数据流，并模拟uvc驱动的工作，把usb数据流（urb包）整理成完整的图片帧（frame），然后对图片帧进行x264的压缩，压缩之后的数据继续通过usbredir传送到客户端。客户端的插件识别到是图片帧数据后，对其进行解压，并把图片帧还原为urb包。以此达成网络间数据的压缩功能（图片压缩，减少包头冗余）。并且以usbredir插件的行事开发。使其具有良好的兼容性（usbredir本身对各平台的兼容性都很优秀）。']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: '亚信科技技术中台全面兼容欧拉生态解决方案',
                                SPEAKER: ['薛浩 亚信科技'],
                                DESC: ['亚信科技的技术中台，采用完整的云原生技术体系构建，历经运营商等行业的大型系统建设上云支撑的考验，已经形成了包括从多云基础设施管理、云原生IaaS的云OS产品、云原生PaaS、边缘云MEC PaaS、Devops等技术中台能力的产品体系，服务公司各个业务产品线。', '云OS，通过统一的云原生架构的平台产品上实现主流公有云、第三方私有云产品，自建云原生IaaS的统一构建和云服务管理。通过k8s云原生的技术构建云OS的统一管理控制面，扩展支持多个第三方云的服务接入，同时也可以基于该控制面基础上管理Openstack和kubernetes（通过扩展kube-virt，kube-ovn等云原生虚拟化组件）来构建IaaS服务。在整个平台的底层计算基础设施兼容性结合华为的鲲鹏+欧拉操作系统实现虚拟机、存储、网络等基础设施云原生虚拟机化能力的构建和开放。', '全域PaaS，包括数据中心级和边缘两套产品，通过一套云原生的架构基础设施层可以结合云OS产品，也可以直接兼容第三方云平台能力，通过PaaS中的弹性计算支持的多平面、mesos和k8s的多集群的纳管和开放服务的能力，在平面级和集群级可以兼容性结合华为的鲲鹏+欧拉操作系统实现PaaS层面向业务和应用的全栈技术服务，已完成落地并服务多运营商客户的CRM、BOSS等核心系统化的国产鲲鹏、欧拉+x86异构双平面的资源池的支撑体系中，目前还在推进结合欧拉打通和边缘MEC PaaS的协同的解决方案，同时推向垂直行业信息化领域。']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: '基于云原生技术分布式构建 Linux 发行版的实践分享',
                                SPEAKER: ['王建民 中国科学院软件研究所'],
                                DESC: ['EulixOS 是最早一批基于 openEuler 操作系统研发的发行版之一。在发行版的研发过程中，时常面对编译构建周期长、依赖关系复杂、软件包迭代频繁的问题，进而时常导致研发中版本不稳定、软件包合入相互等待的问题，尤其是在编译资源有限的情况下。EulixOS在研发过程中，结合团队、资源都有限的情况下，结合云原生技术对编译构建的改造，实现了较为轻量级、易部署、多架构、分布式的编译构建系统，对于更多团队基于openEuler 操作系统进行二次的商业发行版定制有借鉴意义。']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: '从云计算谈系统架构演化趋势',
                                SPEAKER: ['汪照辉  中国银河证券'],
                                DESC: ['对于企业IT系统构建，开源的基础操作是基本的底座，但企业IT系统融合建设的趋势已经非常明显，传统单体建设的思路已经不合时宜，所以对很多企业来说要逐步实现基础设施资源、基础平台、业务应用系统的融合，以适应业务和技术发展的需要。从虚拟化、资源池到超融合、多云管理等，其实目的都是为了实现基础设施资源的融合，能够为上层业务系统提供用之不竭的资源能力。其实从这张图我们可能很清晰的看到多云管理（混合云管理）的重要价值。对于大部分企业来说，多云管理平台不但要管理私有云、公有云，还可能需要管理企业自身的很多物理服务器，以及虚拟化平台所提供的虚拟机管理，这样才能更好的支持上层的容器的调度和管理，以满足不同业务应用容器化对不同基础设施资源的需求。所以企业系统建设中，就不能只考虑单一系统建设，必须要考虑系统与系统之间的关系，就像我们所说的，容器云平台和云管平台就是很紧密的支撑关系，而云管则可能管理着企业的物理服务器、虚拟化、超融合、网络资源、存储资源、私有云、行业云、公有云等基础设施资源，容器云平台又支撑着企业的业务应用，运行着微服务架构的中台服务、中间件、甚至轻量数据库等。所以这是一个整体的体系建设，这也是我们一直提倡“平台融合”的建设思路。当然这并不容易，一个“中台”就让无数企业铩羽而归、爱恨交加，但整个IT系统的建设趋势是逐步走向融合的，系统与系统之间需要标准化的API，就像我们一直说的积木，彼此间的切口要规则、能契合，才能比较快的搭成期待的作品。']
                            },
                            {
                                TIME: '17:00-17:30',
                                THEME: '基于可进化架构的新一代云基础设施',
                                SPEAKER: ['高广生 易捷行云'],
                                DESC: ['面对客户业务快速变化，云平台本身应具备可进化能力，EasyStack的易捷行云新一代云基础设施ECF（EasyStack Cloud Foundation）以开源生态产品化为基础，进行自主创新设计和研发构建的基于数字原生架构的一体化、场景化、可进化的全新一代云平台。已有超过500个客户在使用该产品，云基础设施ECF一套软件栈可以同时支持x86，Arm多种指令集，同时提供包括容器，云主机，裸金属多种算力，支持一个Region同时支持多种CPU架构服务器即一云多芯，同时具备全栈全平⾯OTA（Over The Air）能力，可以平滑⽆感升级包含操作系统在内的所有云平台软件，将不再受限于软件版本的限制，从⽽在某种意义上实现云平台永续⽣命周期。']
                            },
                            {
                                TIME: '17:30-18:00',
                                THEME: '虚拟化硬件加速-vDPA框架以及新浪私有云实践',
                                SPEAKER: ['杨云鹏 新浪'],
                                DESC: ['']
                            },
                        ]
                    },
                    {
                        TITLE: ['Session 3', '兼容性'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: 'HPC应用基于openEuler的迁移实践',
                                SPEAKER: ['李成鹏 软通动力信息技术股份有限公司'],
                                DESC: ['随着大数据、云计算等技术的发展与广泛应用，HPC在行业中的应用也越来越广泛。本次议题将对多款HPC软件到openEuler的跨平台迁移实践进行技术分享。']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: '携手openeuler应对操作系统国产化转型',
                                SPEAKER: ['叶青龙 统信软件'],
                                DESC: ['探讨操作系统国产化转型中的兼容性挑战，并分享统信软件结合迁移工具协助客户解决业务软硬件兼容问题转型欧拉版操作系统。']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: 'SW64自主架构遇上开源欧拉，产业生态兼容的新变革',
                                SPEAKER: ['周元超 普华基础软件'],
                                DESC: ['']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: '欧拉开源社区全球化能力建设与展望',
                                SPEAKER: ['刘鹏 华为'],
                                DESC: ['如何服务好世界各地的开发者，匹配当地的语言、文化、开发习惯和偏好，是openEuler社区深化开源的一大挑战。openEuler G11N SIG，初步探索出了一套全球化理论和方法，并进行了若干全球化实践，希望帮助加快openEuler的全球化的进程。']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: 'oepkgs 开放软件包服务',
                                SPEAKER: ['纪涛 中国科学院软件研究所'],
                                DESC: ['oepkgs 全称开放软件包服务由中国科学院软件研究所、openEuler 社区共同发起并提供支持，旨在为个人开发者、开源社区、OSV、ISV提供免费的软件包、容器镜像的构建、分发和下载服务的第三方平台。', '从使用的角度为大家介绍平台的注册、构建、目标架构的支持、仓库服务、查看日志等流程。', '同时为大家介绍 oepkgs 平台后续会集成的一些功能，例如签名、测试、搜索、集成合规性检查与安全检查等。']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: 'CentOS迁移与操作系统兼容性生态建设',
                                SPEAKER: ['高巍 麒麟软件有限公司'],
                                DESC: ['CentOS替代工作进展、方法及行业案例']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: 'openEuler 兼容性列表建设与实践',
                                SPEAKER: ['李萍  华为'],
                                DESC: ['北向兼容性软件清单来源，覆盖场景']
                            },
                            {
                                TIME: '17:00-17:30',
                                THEME: 'OSV认证体系实践与探索',
                                SPEAKER: ['李君弋 华为'],
                                DESC: ['介绍osv认证方案和认证体系，如何让osv走openEuler的技术路线']
                            },
                        ]
                    },
                    {
                        TITLE: ['Session 4', '安全&可靠性&运维'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: '为数据安全而生，统信软件备份还原工具分享',
                                SPEAKER: ['高冲 统信软件'],
                                DESC: ['统信软件将探讨系统运维中备份与恢复的常用技术方案, 并介绍统信备份还原工具的原理、解决案例以及未来的技术规划。']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: '服务器集中运维管理系统',
                                SPEAKER: ['唐杰 湖南麒麟信安股份有限公司'],
                                DESC: ['支持大批量资产的集中管理，性能监控和告警，日志的集中存储和查询，批量软件升级，批量账户管理，u盘设备管控和安全加固。操作简便，功能强大，提高运维效率。']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: '欧拉开源社区原生运维平台 -- PilotGo',
                                SPEAKER: ['杨昭 麒麟软件有限公司'],
                                DESC: ['PilotGo是openEuler社区原生孵化的运维管理平台，提供大规模集群的主机监控告警、CVE管理、软件包安装升级管理及批量运维操作等功能，保障业务系统安全、稳定运行。同时提供插件机制，对接原有操作系统的多种运维工具，可提供无感知的运维平台切换。']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: '从攻击者角度看Linux内核安全',
                                SPEAKER: ['姚俊/王晓东 360政企安全'],
                                DESC: ['Linux系统在服务器和个人桌面市场有着广泛的使用，作为底层系统，其安全性非常重要。一旦被攻破，商业和个人数据可能被篡改或泄露。本议题以内核中的某个漏洞为案例，除了分析漏洞根因，还会揭秘如何借助该漏洞完成漏洞利用。同时，议题将探讨如何构建更加安全的Linux系统。']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: '基于蓬莱TEE的RISC-V可信机器学习框架',
                                SPEAKER: ['冯二虎 蓬莱TEE'],
                                DESC: ['']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: 'Sec-Anti-SCA基于编译器的CPU侧信道漏洞防护技术',
                                SPEAKER: ['胡科开/吴财军 华为技术有限公司'],
                                DESC: ['自2018年针对处理器cache架构的幽灵和熔断安全漏洞被Google Project Zero曝光以来，新型侧信道漏洞的防护与消减就成为业界热点与难题。业界主流公司如Intel、微软、谷歌等都推出了基于编译器的软硬结合的解决方案，覆盖GCC、LLVM、Visual、C++等主流编译器，典型代表技术有Retpoline、Randpoline等。Gcc-Anti-SCA项目基于GCC编译器提供一个独立安全编译插件，主要针对ARM架构，通过静态代码扫描和模式识别的方式，自动识别源代码中的高风险代码段，并插入ARM架构下相应的安全防护指令。支持ARMv8.5侧信道防护新指令，并向前兼容ARMv8.0及更早的架构。在尽可能多的识别风险点，保证安全性的同时，持续优化，减少误报，把代码性能损失控制在极小的范围内。']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: '操作系统漏洞修复运维探讨',
                                SPEAKER: ['韩永忠  普华基础软件'],
                                DESC: ['对于操作系统安全漏洞已经可实现异常行业检测，漏洞的风险评估以及恶意的程序检测，发现安全隐患后需要等待上游产商给予支持。隐患无法第一时间进行修复。为了解决此问题，操作系统修复的最后一公里：在发现安全隐患后、实现自动获取补丁提交更新计划、提供回退手段形成自动化的运维手段，帮助非云端客户解决本地数据中心的操作系统安全隐患。']
                            },
                            {
                                TIME: '17:00-17:30',
                                THEME: '基于认知技术的openEuler漏洞感知系统',
                                SPEAKER: ['杨牧天 中科微澜'],
                                DESC: ['openEuler开源操作系统作为重要的信息基础设施和生态底座，对自身安全性有很高的要求，为此，我们在openEuler中创新性的引入认知技术，构建openEuler智能化漏洞感知能力。']
                            },
                        ]
                    },
                    {
                        TITLE: ['Session 5', '分布式&多样性计算'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: '仿真软件弹性计算',
                                SPEAKER: ['王松松 哈尔滨工业大学'],
                                DESC: ['大型仿真软件运行时多需要长时间并发运行，遇到某个计算节点挂掉后容易前功尽弃，因此发展弹性计算十分重要']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: 'Arm64上开源分布式存储系统的生态进展',
                                SPEAKER: ['赵帅、刘新良 Linaro'],
                                DESC: ['在Arm64企业市场中，由于其多核并行计算和高性能IO的优势，使得Arm64在分布式存储领域拥有了使用场景。然而软件生态方面，Arm64依然有很长的路要走，不仅仅在于软件使能，项目CI，同时还需要针对相关场景的性能优化。Linaro和会员共同努力，致力于推动分布式存储系统的软件开发和生态进步。目前，我们已经在分布式存储系统，加速库，HPC文件系统等领域取得了一些进展。我们的工作主要基于对项目的使能，CI支持以及针对成熟系统在Arm64上的性能优化，同时也涉及了一些在openEuler上针对HPC文件系统的使能和验证。在本次分享中，我们将详细介绍盖Ceph，Rook, Lustre等项目的Arm CI进展，HPC文件系统的Arm支持以及在OpenEuler中使能和验证，以及利用PMDK等加速库对分布式存储系统进行优化的工作。']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: '华为元戎-分布式多样性算力的理念和探索',
                                SPEAKER: ['梁义 华为'],
                                DESC: ['']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: '欧拉开源社区GCC优化特性介绍及前瞻',
                                SPEAKER: ['马明泽 华为'],
                                DESC: ['']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: '构建openEuler的分布式能力',
                                SPEAKER: ['孙宏伟 华为'],
                                DESC: ['']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: 'CirroData分布式数据库发展方向和工程实践',
                                SPEAKER: ['董山 东方国信'],
                                DESC: ['（1）企业级分布式架构发展方向', '（2）创新技术及在华为平台的工程实践', '（3）技术展望']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: '飞腾平台基础算法优化',
                                SPEAKER: ['阳柳  飞腾信息技术有限公司'],
                                DESC: ['芯片是骨，软件是魂。高水平应用软件是提升飞腾平台的重要手段之一，而高性能的基础算法库是编写高水平应用软件的基础。本议题围绕飞腾软件生态的发展规划，紧密结合用户需求，探讨基础算法优化过程中的经验和收获。']
                            },
                            {
                                TIME: '17:00-17:30',
                                THEME: 'openEuler 容器 OS升级介绍',
                                SPEAKER: ['李元戎 华为'],
                                DESC: ['']
                            },
                            {
                                TIME: '17:30-18:00',
                                THEME: '霄瀚全场景操作系统实践和应用',
                                SPEAKER: ['解伟俊  拓维'],
                                DESC: ['']
                            },
                        ]
                    },
                    {
                        TITLE: ['Session 6', '边缘&嵌入式'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: '欧拉开源操作系统嵌入式方向的发展规划',
                                SPEAKER: ['林子畅 华为技术有限公司'],
                                DESC: ['介绍openEuler在嵌入式方向，与之前服务器领域的异同点，后续可能的特性、功能规划']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: '面向嵌入式场景的构建系统Yocto应用与思考',
                                SPEAKER: ['任慰 华为技术有限公司'],
                                DESC: ['当前openEuler的构建系统OBS主要是面向服务器场景的，对于嵌入式场景支持并不好，例如不支持交叉编译，裁剪的力度有限等。为了使openeuler的相关成果能够延伸到嵌入式领域，我们引入了面向嵌入式场景的构建系统Yocto。本议题将分享Yocto的基本情况、如何基于Yocto构建openEuler embedded、存在的问题与挑战以及面向未来的一些思考和规划']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: '推动RISC-V软件生态及openEuler在VisionFive开发板的适配',
                                SPEAKER: ['朱潇潇 赛昉科技'],
                                DESC: ['']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: 'RV64 异构多核处理器下实现RT-Thread和openeuler同时运行',
                                SPEAKER: ['张海涛 RT-thread'],
                                DESC: ['']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: '云原生边缘计算平台架构与实践',
                                SPEAKER: ['王杰章 华为'],
                                DESC: ['现如今边缘计算的应用场景非常丰富，而且面临着诸多挑战，例如：边云通信网络质量低、边缘资源受限、边缘应用离线自治和本地故障恢复、边缘节点高度分散和资源异构。针对上述问题，我们提出了云原生边缘计算平台的架构与实践——KubeEdge，并配套边缘分布式网络组件EdgeMesh与边缘协调AI框架Sedna。']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: '云边协同在太空卫星上的实践探索',
                                SPEAKER: ['林培峰  SUSE'],
                                DESC: ['本议题通过实际的案例分享，探索云边协同技术如何在太空卫星上落地，如何利用云原生、DevSecOpt和边缘技术更好的在太空卫星上使用更低成本硬件，构建更安全可靠软件，实现在太空卫星上更可靠更新软件，以及更好实现AI/ML计算。']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: 'Linux实时性实践与探索',
                                SPEAKER: ['郭皓 麒麟软件'],
                                DESC: ['基于openeuler做的Linux实时性探索和研究，已发布Linux嵌入式操作系统demo，支持飞腾、鲲鹏、x86平台']
                            },
                        ]
                    }
                ]
            },
        },
        NAV_LIST: [
            {
                key: '#live',
                name: '精彩回顾'
            },
            {
                key: '#agenda',
                name: '峰会日程'
            },
            {
                key: '#exhibition',
                name: '线上展厅'
            },
            {
                key: '#lecturer',
                name: '演讲嘉宾'
            },
            {
                key: '#publisher',
                name: '出品人'
            },
            {
                key: '#construction',
                name: '共建单位'
            }
        ],
        CONSTRUCTION: {
            WEB_TITLE: "/img/summit/summit2021/Co-construction/web-title.png",
            MOBILE_TITLE: "/img/summit/summit2021/Co-construction/mobile-title.png",
            GUIDANCE: {
                TEXT_TITLE: "指导单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/openaton.png",
                        LINK: ""
                    }
                ]
            },
            HOST: {
                TEXT_TITLE: "主办单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/openEulerlogo.png",
                        LINK: ""
                    }
                ]
            },
            STRATEGIC: {
                TEXT_TITLE: "战略合作单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/huawei.png",
                        LINK: ""
                    }
                ]
            },
            CO_SPONSORED: {
                TEXT_TITLE: "联合主办单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/qilinsoft.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/qilinxinan.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/suse.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/tongxin.png",
                        LINK: ""
                    }
                ]

            },
            CO_ORGANIZER: {
                TEXT_TITLE: "协办单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/yidong.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/dianxing.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/liantong.png",
                        LINK: ""
                    },               
                    {
                        IMG: "/img/summit/summit2021/Co-construction/puhua.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/turbolinux.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/phytium.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/shentai.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/softstone.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/easystack.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/360.png",
                        LINK: ""
                    },  
                    {
                        IMG: "/img/summit/summit2021/Co-construction/dongfangtong.png",
                        LINK: ""
                    },                                 
                ]
            },
            SUPPORT: {
                TEXT_TITLE: "支持单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/jdcloud.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/xinlang.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/kengpeng.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/zhongkedachuang.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/tianyuan.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/bessystem.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/qingcloud.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/starfive.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/winhong.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/asiainfo.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/nuclei.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/xsky.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/guoxing.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/iiioka.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/isstech.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/huayun.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/kaifazhineng.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/iscas.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/ruihe.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/langcher.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/xinchen.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/youxi.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/beilian.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/talkweb.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/shenzhou.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/huanghe.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/baixing.png",
                        LINK: ""
                    },
                ]
            },
            FOUNDATION: {
                TEXT_TITLE: "友好基金会",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/linux.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/openinfra.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/linaro.png",
                        LINK: ""
                    },
                ]
            }
        },
        LECTURER: {
            LECTURER_BANNER: {
                web: '/img/summit/summit2021/lecturer/sperkertitle.png',
                mobile: '/img/summit/summit2021/lecturer/sperkertitle_mo.png'
            },
            LECTURER_LIST: [
                {
                    IMG: '/img/summit/summit2021/lecturer/yangtao.png',
                    NAME: '杨涛',
                    POSITION: '开放原子开源基金会 理事长'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/jiangdayong.png',
                    NAME: '江大勇',
                    POSITION: '欧拉开源社区理事长'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/wuyanjun.png',
                    NAME: '武延军',
                    POSITION: '欧拉开源社区副理事长'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/qiuchengfeng.png',
                    NAME: '邱成锋',
                    POSITION: '欧拉开源社区秘书长'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/huxinwei.png',
                    NAME: '胡欣蔚',
                    POSITION: '欧拉开源社区 技术委员会主席'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/chenhaibo.png',
                    NAME: '陈海波',
                    POSITION: '上海交通大学教授 华为操作系统首席科学家'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/gaowei.png',
                    NAME: '高巍',
                    POSITION: '欧拉开源社区 用户委员会主席'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/qinxiaokang.png',
                    NAME: '秦小康',
                    POSITION: 'SUSE大中华区总裁'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/wangpan.png',
                    NAME: '王攀',
                    POSITION: '麒麟信安副总裁'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/zhanglei.png',
                    NAME: '张磊',
                    POSITION: '统信软件CTO'
                },
            ],
            PUBLISHER_BANNER: {
                web: '/img/summit/summit2021/lecturer/publishertitle.png',
                mobile: '/img/summit/summit2021/lecturer/publishertitle_mo.png'
            },
            PUBLISHER_LIST: [
                {
                    IMG: '/img/summit/summit2021/lecturer/guohanjun.png',
                    NAME: '郭寒军',
                    POSITION: '欧拉开源社区内核 Maintainer'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/liyong.png',
                    NAME: '李勇',
                    POSITION: 'SUSE软件工程顾问'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/yixiujiang.png',
                    NAME: '尹秀江',
                    POSITION: '麒麟软件工程师'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/yanshuanghai.png',
                    NAME: '严海双',
                    POSITION: '中移云能力中心 内核研发专家'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/shenxiang.png',
                    NAME: '沈翔',
                    POSITION: '普华基础软件总经理'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/dukaitian.png',
                    NAME: '杜开田',
                    POSITION: '欧拉开源社区 兼容性SIG组Maintainer'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/yeqinglong.png',
                    NAME: '叶青龙',
                    POSITION: '服务器操作系统项目总监 欧拉开源社区 技术委员会委员'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/liujingang.png',
                    NAME: '刘金刚',
                    POSITION: '欧拉开源社区 技术委员会委员'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/caihaomin.png',
                    NAME: '蔡灏旻',
                    POSITION: '华为容器团队架构师'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/shiyong.png',
                    NAME: '石勇',
                    POSITION: '欧拉开源社区 技术委员会委员'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/panjianfeng.png',
                    NAME: '潘剑锋',
                    POSITION: '360集团副总裁 首席科学家'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/yangliu.png',
                    NAME: '阳柳',
                    POSITION: '飞腾资深软件架构师'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/xiekunxun.png',
                    NAME: '谢焜勋',
                    POSITION: '华为嵌入式操作系统 技术专家'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/lishouyong.png',
                    NAME: '刘寿永',
                    POSITION: ' 中科创达首席架构师'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/chenjingwei.png',
                    NAME: '陈景伟',
                    POSITION: ' 赛昉生态市场高级总监'
                },
            ]
        },
        SUMMIT_INTRODUCE: "The openEuler Summit is an event for the global developer community and IT professionals who want to learn about openEuler open source products. openEuler has evolved from a server OS into a digital infrastructure (version: 21.09) that supports IT, CT, and OT services in server, cloud native, edge computing, and embedded scenarios. At the openEuler Summit 2021, we invite developers, users, and software enthusiasts to discuss new innovations and features of openEuler, and learn from others in the community.",
        HIGHLIGHTS: "Highlights"
    },
    ru: {
        SUMMIT_BANNER: {
            MOBILE_IMG: "https://openeuler-website-beijing.obs.cn-north-4.myhuaweicloud.com/openEuler-summit-2021/images/%E6%AC%A7%E6%8B%89-375x300-%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F%E9%A6%96%E9%A1%B5.png",
            PC_IMG: "https://openeuler-website-beijing.obs.cn-north-4.myhuaweicloud.com/openEuler-summit-2021/images/1920x380%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F.png"
        },
        LIVETITLE: '操作系统产业峰会生态伙伴直播间',
        TEN_TITLE:'openEuler Summit 2021 直播间',
        PC_LIVEIMG: '/img/summit/home/zh-pc-liveroom.png',
        MOBILE_LIVEIMG: '/img/summit/home/zh-mobile-liveroom.png',
        SUMMITLIVE: {
           NINE :[
            {
                ID: 9862,
                THEME: '操作系统产业峰会2021',
                TIME: '09:30-11:30',
                OPTION: '09:30-11:30 操作系统产业峰会2021',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9862?lang=zh&thirdId='
            },
            {
                ID: 9863,
                THEME: '麒麟软件',
                TIME: '14:00-16:40',
                OPTION: '14:00-16:40 麒麟软件',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9863?lang=zh&thirdId='
            },
            {
                ID: 9900,
                THEME: '麒麟信安',
                TIME: '14:00-16:40',
                OPTION: '14:00-16:40 麒麟信安',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9900?lang=zh&thirdId='
            },
            {
                ID: 9901,
                THEME: '统信',
                TIME: '14:00-17:00',
                OPTION: '14:00-17:00 统信',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9901?lang=zh&thirdId='
            },
            {
                ID: 9864,
                THEME: '中科创达',
                TIME: '14:00-16:40',
                OPTION: '14:00-16:40 中科创达',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9864?lang=zh&thirdId='
            },
            {
                ID: 9865,
                THEME: '普华基础软件',
                TIME: '14:00-16:30 ',
                OPTION: '14:00-16:30 普华基础软件',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9865?lang=zh&thirdId='
            },
           ],
           TEN : [
            {
                ID: 9866,
                THEME: 'openEuler Summit 2021',
                TIME: '9:30-11:55 ',
                OPTION: '9:30-11:55 openEuler Summit 2021',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9866?lang=zh&thirdId='
            },
            {
                ID: 9867,
                THEME: '内核',
                TIME: '13:00-17:30 ',
                OPTION: '13:00-17:30 内核分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9867?lang=zh&thirdId='
            },
            {
                ID: 9868,
                THEME: '云&虚拟化',
                TIME: '13:00-18:00 ',
                OPTION: '13:00-18:00 云&虚拟化分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9868?lang=zh&thirdId='
            },
            {
                ID: 9869,
                THEME: '兼容性',
                TIME: '13:00-17:30 ',
                OPTION: '13:00-17:30 兼容性分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9869?lang=zh&thirdId='
            },
            {
                ID: 9870,
                THEME: '安全&可靠性&运维',
                TIME: '13:00-17:30 ',
                OPTION: '13:00-17:30 安全&可靠性&运维分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9870?lang=zh&thirdId='
            },
            {
                ID: 9871,
                THEME: '分布式&多样性计算',
                TIME: '13:00-18:00 ',
                OPTION: '13:00-17:30 分布式&多样性计算分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9871?lang=zh&thirdId='
            },
            {
                ID: 9872,
                THEME: '边缘&嵌入式',
                TIME: '13:00-17:30 ',
                OPTION: '13:00-17:30 边缘&嵌入式分论坛',
                LIVEURL: 'https://vhall.huawei.com/v2/watch/9872?lang=zh&thirdId='
            },
           ]
        },
        AGENDA: {
            WEB_TITLE: '/img/summit/summit2021/zh-pc-summit2021.png',
            MOBILE_TITLE: '/img/summit/summit2021/zh-mobile-summit2021.png',
            DATE: ['11月09日', '11月10日', '上午', '下午'],
            SUB_FORUM: '操作系统产业峰会生态伙伴分论坛',
            FORUM_HEAD: ['麒麟软件', '麒麟信安', 'SUSE', '统信软件', '中科创达', '普华基础软件'],
            FORENOON_AGENDA_9: [
                {
                    TIME: '09:30 - 09:45',
                    THEME: '开场致辞',
                    SPEAKER: '神秘嘉宾',
                },
                {
                    TIME: '09:45 - 10:00',
                    THEME: '欧拉开源操作系统重大发布',
                },
                {
                    TIME: '10:00 - 10:10',
                    THEME: '操作系统发展展望',
                    SPEAKER: '中国工程院院士',
                },
                {
                    TIME: '10:10 - 10:20',
                    THEME: '立根铸魂，共建操作系统新生态',
                    SPEAKER: '华为',
                },
                {
                    TIME: '10:20 - 10:25',
                    THEME: '操作系统产业宣誓',
                },
                {
                    TIME: '10:25 - 10:55',
                    THEME: '行业用户实践分享',
                    SPEAKER: '运营商、金融等行业重磅嘉宾'
                },
                {
                    TIME: '10:55 - 11:05',
                    THEME: '携手欧拉开源创新，服务中国数字时代',
                    SPEAKER: '麒麟软件',
                },
                {
                    TIME: '11:05 - 11:15',
                    THEME: '扎根开源生态，服务中国企业，帮助中国开源系统走向世界',
                    SPEAKER: 'SUSE',
                },
                {
                    TIME: '11:15 - 11:20',
                    THEME: '欧拉生态创新中心发布',
                },
                {
                    TIME: '11:20 - 11:30',
                    THEME: '智能基座 · 欧拉人才发展加速计划发布',
                },
            ],
            FORENOON_AGENDA_10: [
                {
                    TIME: '09:30 - 09:35',
                    THEME: '欢迎致辞',
                    SPEAKER: '杨涛',
                    POSITION: '开放原子开源基金会理事长'
                },
                {
                    TIME: '09:35 - 09:45',
                    THEME: '凝聚创新力量 逐梦数字时代星辰大海',
                    SPEAKER: '江大勇',
                    POSITION: '欧拉开源社区理事长'
                },
                {
                    TIME: '09:45 - 09:50',
                    THEME: '欧拉开源社区理事会升级仪式',
                    SPEAKER: '邱成锋',
                    POSITION: '欧拉开源社区秘书长'
                },
                {
                    TIME: '09:50 - 09:55',
                    THEME: '欧拉开源社区技术委员会换届升级仪式',
                    SPEAKER: '邱成锋',
                    POSITION: '欧拉开源社区秘书长'
                },
                {
                    TIME: '09:55 - 10:10',
                    THEME: '全场景欧拉 - 唯有无边界开放才能无止境增长',
                    SPEAKER: '胡欣蔚',
                    POSITION: '欧拉开源社区技术委员会主席'
                },
                {
                    TIME: '10:10 - 10:40',
                    THEME: 'openEuler&Friends 2.0-协作联创激发无限可能',
                    SPEAKER: '中国电信、中国移动、中国联通、中科创达、华为、品高软件'
                },
                {
                    TIME: '10:40 - 10:55',
                    THEME: '中国银行操作系统创新实践',
                    SPEAKER: '中国银行和麒麟软件联合演讲',
                },
                {
                    TIME: '10:55 - 11:10',
                    THEME: '中国移动云原生生态创新实践',
                    SPEAKER: '中国移动和SUSE联合演讲',
                },
                {
                    TIME: '11:10 - 11:25',
                    THEME: '国家电网调度控制系统创新实践',
                    SPEAKER: '中国电科院和麒麟信安联合演讲'
                },
                {
                    TIME: '11:25 - 11:40',
                    THEME: '中国邮政业务应用创新实践',
                    SPEAKER: '中国邮政和统信软件联合演讲',
                },
                {
                    TIME: '11:40 - 11:50',
                    THEME: '仰望星空-操作系统演讲与前沿发展思考',
                    SPEAKER: '陈海波',
                    POSITION: '上海交通大学教授 、华为操作系统首席科学家'
                },
                {
                    TIME: '11:50 - 11:55',
                    THEME: '欧拉开源社区超级用户大奖',
                    SPEAKER: '高巍',
                    POSITION: '欧拉开源社区用户委员会主席'
                }
            ],
            AFTERNOON_AGENDA_9: [
                // 麒麟软件
                [
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '领导致辞',
                        SPEAKER: '华为领导'
                    },
                    {
                        TIME: '14:10 - 14:25',
                        THEME: '合作共赢，生态共生',
                        SPEAKER: '孔金珠',
                        POSITION: '麒麟软件 高级副总经理'
                    },
                    {
                        TIME: '14:25 - 14:40',
                        THEME: '开源新时代-麒麟软件积极拥抱开源社区',
                        SPEAKER: '侯健',
                        POSITION: '麒麟软件 服务器研发部技术总监'
                    },
                    {
                        TIME: '14:40 - 14:55',
                        THEME: '中国联通自主操作系统实践经验分享',
                        SPEAKER: '肖微',
                        POSITION: '联通软研院'
                    },
                    {
                        TIME: '14:55 - 15:00',
                        THEME: '麒麟鲲鹏联合创新实验室揭牌',
                        SPEAKER: '刘海涛、高巍',
                    },
                    {
                        TIME: '15:00 - 15:10',
                        THEME: '北京鲲鹏联合创新中心领导致辞',
                        SPEAKER: '刘海涛',
                        POSITION: '北京鲲鹏联合创新中心 首席运营官'
                    },
                    {
                        TIME: '15:10 - 15:15',
                        THEME: '麒麟创客北京·鲲鹏应用创新大赛2021颁奖仪式',
                        SPEAKER: '麒麟软件、华为领导'
                    },
                    {
                        TIME: '15:15 - 15:25',
                        THEME: '幸运抽奖 &茶歇',
                    },
                    {
                        TIME: '15:25 - 15:40',
                        THEME: '开放联合，共建软件生态',
                        SPEAKER: '刘勇鹏',
                        POSITION: '飞腾 副总裁、软件技术方案中心总经理'
                    },
                    {
                        TIME: '15:40 - 15:55',
                        THEME: '护航国产操作系统 打造安全计算环境',
                        SPEAKER: '李栋',
                        POSITION: '奇安信 椒图事业部副总经理'
                    },
                    {
                        TIME: '15:55 - 16:10',
                        THEME: '价值驱动国产基础软硬件协同发展 ',
                        SPEAKER: '王容多',
                        POSITION: '同方 战略生态中心总经理 / 行业销售中心总经理'
                    },
                    {
                        TIME: '16:10 - 16:25',
                        THEME: '携手打造基础软件根技术，助力用户创造更大价值 ',
                        SPEAKER: '肖枫',
                        POSITION: '海量数据 总裁'
                    },
                    {
                        TIME: '16:25 - 16:40',
                        THEME: '国产数据库与操作系统的合作',
                        SPEAKER: '宋瑞',
                        POSITION: '人大金仓 高级副总裁'
                    },
                    {
                        TIME: '16:40 - 16:55',
                        THEME: '国产中间件创新与应用',
                        SPEAKER: '谢耘',
                        POSITION: '东方通 首席科学家'
                    },
                    {
                        TIME: '16:55 - 17:10',
                        THEME: '基于麒麟V10的分布式中间件新核心',
                        SPEAKER: '成勇斌',
                        POSITION: '金蝶天燕 副总经理'
                    },
                    {
                        TIME: '17:10 - 17:20',
                        THEME: '幸运抽奖',
                    },
                ],
                // 麒麟信安
                [
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '欢迎致辞',
                        SPEAKER: '麒麟信安领导、华为领导',
                    },
                    {
                        TIME: '14:10 - 14:25',
                        THEME: 'openEuler技术分享',
                        SPEAKER: '欧拉开源社区技术专家'
                    },
                    {
                        TIME: '14:25 - 14:40',
                        THEME: '根植欧拉开源社区构建麒麟信安操作系统',
                        SPEAKER: '陈松政',
                        POSITION: '麒麟信安高级副总裁'
                    },
                    {
                        TIME: '14:40 - 14:50',
                        THEME: '欢乐抽奖',
                    },
                    {
                        TIME: '14:50 - 15:05',
                        THEME: '麒麟信安操作系统的工控属性',
                        SPEAKER: '石勇',
                        POSITION: '麒麟信安操作系统产品总监'
                    },
                    {
                        TIME: '15:05 - 15:20',
                        THEME: '麒麟信安操作系统的云原生属性',
                        SPEAKER: '孙利杰',
                        POSITION: '麒麟信安操作系统、云计算产品线研发总监'
                    },
                    {
                        TIME: '15:20 - 15:30',
                        THEME: '联合实验室揭牌仪式',
                    },
                    {
                        TIME: '15:30 - 15:40',
                        THEME: '欢乐抽奖',
                    },
                    {
                        TIME: '15:40 - 15:55',
                        THEME: 'CentOS停服后国产操作系统的蓝海商机 ',
                        SPEAKER: '任启',
                        POSITION: '麒麟信安高级副总裁'
                    },
                    {
                        TIME: '15:55 - 16:10',
                        THEME: '麒麟信安操作系统在电力调度和航天测发控核心系统创新应用实践',
                        SPEAKER: '王攀',
                        POSITION: '麒麟信安副总裁'
                    },
                    {
                        TIME: '16:10 - 16:30',
                        THEME: '圆桌论坛 ',
                        SPEAKER: '合作伙伴'
                    },
                    {
                        TIME: '16:30 - 16:40',
                        THEME: '欢乐抽奖、结束',
                    },
                ],
                // SUSE
                [
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '数硕Linux的定位与发展',
                        SPEAKER: '江永清',
                        POSITION: 'SUSE 大中华区董事长'
                    },
                    {
                        TIME: '14:10 - 14:20',
                        THEME: '欧拉开源社区支持服务发布仪式',
                        SPEAKER: '江永清',
                        POSITION: 'SUSE 大中华区董事长',
                        SPEAKER2: '陈伟',
                        POSITION2: 'SUSE 大中华区Service Director'
                    },
                    {
                        TIME: '14:20 - 14:40',
                        THEME: '欧拉开源社区支持服务',
                        SPEAKER: '陈伟',
                        POSITION: 'SUSE 大中华区Service Director'
                    },
                    {
                        TIME: '14:40 - 15:10',
                        THEME: '数硕Linux技术展望',
                        SPEAKER: '刘恺',
                        POSITION: 'SUSE Euler PD Manager'
                    },
                    {
                        TIME: '15:10 - 15:25',
                        THEME: '茶歇',
                    },
                    {
                        TIME: '15:25 - 15:55',
                        THEME: 'Rancher + iSulad解决方案',
                        SPEAKER: '江鹏',
                        POSITION: 'SUSE 大中华区技术总监'
                    },
                    {
                        TIME: '15:55 - 16:25',
                        THEME: '助力国产硬件，构建自主可控业务生态',
                        SPEAKER: '于明',
                        POSITION: '长城信息股份有限公司副总裁，人工智能所所长'
                    },
                    {
                        TIME: '16:25 - 16:55',
                        THEME: '云原生安全架构的应用实践',
                        SPEAKER: '刘玮',
                        POSITION: '上海缔赛信息技术有限公司总经理'
                    },
                    {
                        TIME: '16:55 - 17:10',
                        THEME: '观众互动',
                        SPEAKER: '现场主持',
                    },
                ],
                // 统信软件
                [
                    {
                        TIME: '13:30 - 14:00',
                        THEME: '签到入场',
                    },
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '欢迎致辞',
                        SPEAKER: '朱建忠',
                        POSITION: '统信软件 高级副总裁'
                    },
                    {
                        TIME: '14:10 - 14:40',
                        THEME: '打造数字时代新底座——统信服务器操作系统',
                        SPEAKER: '孟杰',
                        POSITION: '统信软件 服务器OS产线副总经理'
                    },
                    {
                        TIME: '14:40 - 15:10',
                        THEME: '打造统信UOS操作系统新生态',
                        SPEAKER: '张木梁',
                        POSITION: '统信软件 生态中心副总经理'
                    },
                    {
                        TIME: '15:10 - 15:40',
                        THEME: 'openEuler 技术分享',
                        SPEAKER: 'openEuler 技术专家',
                    },
                    {
                        TIME: '15:40 - 15:50',
                        THEME: '茶歇',
                    },
                    {
                        TIME: '15:50 - 16:05',
                        THEME: '共建生态、合作共赢',
                        SPEAKER: '邓忠良',
                        POSITION: '同方计算机产业本部副总经理'
                    },
                    {
                        TIME: '16:05 - 16:20',
                        THEME: '数据相联，探索价值',
                        SPEAKER: '莫良伟',
                        POSITION: '宝德 软件部总监'
                    },
                    {
                        TIME: '16:20 - 16:35',
                        THEME: '万亿级湖仓一体架构下的统一数据服务平台应用实践',
                        SPEAKER: '陈元熹 ',
                        POSITION: '巨杉数据库',
                        POSITION2: '研发资深总监',
                        POSITION3: '首席架构师'
                    },
                    {
                        TIME: '16:35 - 16:50',
                        THEME: '协同办公系统信创实践与探索',
                        SPEAKER: '杨竹君 ',
                        POSITION: '泛微 政务副总经理'
                    },
                    {
                        TIME: '16:50 - 17:05',
                        THEME: '信创数据交换平台最佳实践 ',
                        SPEAKER: '臧一超 ',
                        POSITION: '普元信息 数智研究院 副总经理'
                    },
                    {
                        TIME: '17:05 - 17:20',
                        THEME: '融合信创生态，打造安全高效的地理信息系统',
                        SPEAKER: '周丹',
                        POSITION: '中地数码 北京副总经理'
                    },
                    {
                        TIME: '17:20 - 17:30',
                        THEME: '抽奖环节',
                    },
                ],
                // 中科达创
                [
                    {
                        TIME: '13:30 - 14:00',
                        THEME: '签到入场',
                    },
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '主持人开场',
                        SPEAKER: '刘寿永',
                        POSITION: '中科创达首席架构师'
                    },
                    {
                        TIME: '14:10 - 14:30',
                        THEME: '云原生边缘计算平台架构与实践',
                        SPEAKER: '王杰章',
                        POSITION: '华为云原生高级工程师'
                    },
                    {
                        TIME: '14:30 - 14:50',
                        THEME: '浅析边缘计算中间件',
                        SPEAKER: '徐晓晶',
                        POSITION: '中科创达软件架构师'
                    },
                    {
                        TIME: '14:50 - 15:10',
                        THEME: 'Intel 边缘软件中心介绍',
                        SPEAKER: '冯伟',
                        POSITION: 'Intel边缘计算架构师'
                    },
                    {
                        TIME: '15:10 - 15:20',
                        THEME: '茶歇 & 交流',
                    },
                    {
                        TIME: '15:20 - 15:40',
                        THEME: '端侧边缘计算赋能千行百业',
                        SPEAKER: '朱勇',
                        POSITION: '中科创达AI技术中心负责人'
                    },
                    {
                        TIME: '15:40 - 16:00',
                        THEME: 'EdgeX加速边缘原生应用',
                        SPEAKER: '路广',
                        POSITION: 'VMWare 中国研发总监'
                    },
                    {
                        TIME: '16:00 - 16:20',
                        THEME: '融合发展助力智能汽车产业腾飞',
                        SPEAKER: '王志杰',
                        POSITION: '中科创达智能汽车SOA产品经理'
                    },
                    {
                        TIME: '16:20 - 16:40',
                        THEME: '双碳背景下的边缘计算和虚拟电厂',
                        SPEAKER: '樊小毅',
                        POSITION: '江行智能CTO'
                    },
                ],
                // 普华基础软件
                [
                    {
                        TIME: '14:00 - 14:10',
                        THEME: '致词',
                        SPEAKER: '华为领导'
                    },
                    {
                        TIME: '14:10 - 14:30',
                        THEME: '开场发言',
                        SPEAKER: '沈翔',
                        POSITION: '普华基础软件事业部总经理'
                    },
                    {
                        TIME: '14:30 - 15:00',
                        THEME: '基于欧拉开源操作系统软硬件新品发布',
                        SPEAKER: '董自强',
                        POSITION: '普华基础软件产品部总经理'
                    },
                    {
                        TIME: '15:00 - 15:20',
                        THEME: '茶歇 & 抽奖环节',
                    },
                    {
                        TIME: '15:20 - 15:50',
                        THEME: '圆桌论坛：多样性算力、业务模式创新模式影响下，操作系统产业未来发展',
                    },
                    {
                        TIME: '15:50 - 16:10',
                        THEME: '深耕基础软件根技术，普华的铸魂之路',
                        SPEAKER: '王伶卓',
                        POSITION: '普华基础软件事业部技术副总'
                    },
                    {
                        TIME: '16:10 - 16:30',
                        THEME: '聚焦行业，普华基础软件多场景应用分享',
                        SPEAKER: '王江涛',
                        POSITION: '普华基础软件高级安全专家'
                    },
                    {
                        TIME: '16:30 - 16:50',
                        THEME: '欢乐抽奖、结束',
                    },
                ],
            ],
            AFTERNOON_AGENDA_10: {
                TIME_LIST: ['13:00-13:30', '13:30-14:00', '14:00-14:30', '14:30-15:00', '15:00-15:30', '15:30-16:00', '16:00-16:30', '16:30-17:00', '17:00-17:30', '17:30-18:00'],
                CARD_LIST: [
                    {
                        TITLE: ['Session 1', '内核'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: '网络新技术MPTCP原理，协议和应用',
                                SPEAKER: ['唐葛亮 SUSE Linux'],
                                DESC: ['介绍网络新技术MPTCP(Multipath TCP)原理和协议，以及当前MPTCP upstream社区的状态，最后和大家讨论MPTCP相关应该场景。']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: '内核热升级技术的应用实践',
                                SPEAKER: ['尹秀江 麒麟软件有限公司', '何静娴 华为'],
                                DESC: ['内核热升级是openEuler社区原生孵化的一项技术，为解决内核CVE漏洞和减少系统宕机时间提供了有利保障，本次议题主要介绍内核热升级技术及分享在麒麟系统上的实践经验']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: '内存分级扩展在天翼云上的实践',
                                SPEAKER: ['张俊平 天翼云科技公司'],
                                DESC: ['使用傲腾内存，虚拟机内存超配，提升内存性价比，提升虚拟机性能']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: 'RISC-V Linux 异构多核架构实现与挑战',
                                SPEAKER: ['Tan Ley Foon 赛昉'],
                                DESC: ['一． 介绍异构多核架构', '二． 介绍Linux 内核对异构多核架构的支持: Energy Awareness Scheduling (EAS) and Capacity Awareness Scheduling (CAS)', '三． RISC-V架构对于异构多核架构的实现与挑战']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: 'Bond 3+高可靠冗余通信解决方案',
                                SPEAKER: ['秦云高 湖南麒麟信安科技股份有限公司'],
                                DESC: ['高可靠性网络通信在国家电网、金融、航天领域的应用中至关重要。', '本方案通过增强Linux内核bond 3广播模式，', '1. 实现UDP零重包，网络故障时自动链路切换的可靠冗余通信。', '2. 实现TCP网络故障时零延时最高可靠冗余通信。']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: '虚拟化技术在SW64自主架构的探索与实践',
                                SPEAKER: ['张毅 中电科申泰信息科技有限公司'],
                                DESC: ['1. Cpu虚拟化在申威架构上的探索与实践：接轨主流，实现了申威架构下的kvm；优化了申威架构下的中断虚拟化（时钟中断、核间中断），明显提高了中断性能。', '2. 内存虚拟化在申威架构上的探索与实践：设计了一种有别于x86架构实现的影子页表机制，该机制充分利用了申威架构的特点。并把它实现，内存虚拟化（影子页表）的相对开销数据优于x86。', '3. IO虚拟化在申威架构上的探索与实践：设计并实现了申威架构下VFIO与IOMMU：以新的驱动方式代替设备原有驱动；实现了申威架构下二级页表映射，并且实现8k和8M的页面粒度支持；以一种新的地址方式来替代真实的物理地址以增强内存的连续性和安全性。目前支持千兆、万兆网卡的设备直通。']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: '内核和进程热补丁技术的实现与应用',
                                SPEAKER: ['唐彬  中国移动云能力中心'],
                                DESC: ['在日常生产过程中，经常会遇到bug或者cve等问题需要升级内核，而当前升级内核需要重启系统，这会影响业务的连续性，为了最大限度避免重启服务器，采用热补丁的方式来修复内核bug或者cve漏洞，本主题主要介绍x86与arm64架构下的内核热补丁技术实现与应用']
                            },
                            {
                                TIME: '17:00-17:30',
                                THEME: '支持多任务的共享虚拟内存池技术',
                                SPEAKER: ['丁天虹 华为技术有限公司'],
                                DESC: ['Linux的多任务间的共享内存对SPA（Share Physiacl Address）支持比较完善，但是在支持SVA（Share Virtual Address）上使用并不方便，任务间如果要获取统一的虚拟地址，需要独立实现地址分配和管理的框架，我们在内核实现了一致性内存管理技术（Share Pool），主要解决CPU多任务之间共享虚拟地址的问题，可以较为方便的为多应用提供统一虚拟地址，该技术适合Linux在AI计算等应用场景的使用']
                            },
                        ]
                    },
                    {
                        TITLE: ['Session 2', '云&虚拟化'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: '不同Arm厂商的CPU互相模拟',
                                SPEAKER: ['仇大玉 华云数据控股集团有限公司'],
                                DESC: ['在公有云或者专属云内，很多时候CPU架构是相通的但是厂商却不一样，尤其在ARM服务器中，默认都是host虚拟化模式，无法屏蔽底层硬件差异，除全软件模拟的方式，但是性能损耗严重，本次topic就如何实现屏蔽底层差异的硬件虚拟化方式下，实现不同ARM Vendor 的CPU互相模拟']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: 'Capsule：全场景统一的新一代 Hypervisor',
                                SPEAKER: ['吴斌 华为'],
                                DESC: ['Capsule是完全由openEuler社区控制的新型Hypervisor项目。类似KVM，Capsule充分使能不同CPU体系的硬件辅助虚拟化能力。不同的是，Capsule采用Rust语言编写以带来更大的安全性。另外，Capsule重塑了Hypervisor架构，使它既可以支持普通虚拟机(满足多种多样的企业应用)，也可以支持安全容器(满足容器化负载应用)，同时还可以支持逻辑分区(满足实时类应用)，真正做到统一各类生态，支持IT/CT/OT全场景应用。']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: '基于欧拉开源操作系统的云底座操作系统NestOS',
                                SPEAKER: ['杜奕威 麒麟软件有限公司'],
                                DESC: ['NestOS是在openEuler社区孵化的云底座操作系统，搭载isulad，podman，docker等主流容器基础平台，可以适应各种不同的基础设施环境，使系统具备十分便捷的集群组建能力，与OKD紧密集成。同时NestOS可以安全的进行系统升级与回滚，可用于大规模下安全的运行容器化工作负载。']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: '摄像头虚拟化',
                                SPEAKER: ['夏华 湖南麒麟信安科技股份有限公司'],
                                DESC: ['桌面云行业，通常使用usbredir作为核心技术进行usb类设备的重定向。但实际场景中，诸如usbvideo类设备，由于其过于庞大的数据流交互，收带宽限制，在云桌面场景下，使用起来非常困难。为了应对该场景，我们采用了最新的XX方案进行摄像头重定向，其根本原理在于，把交互数据的图像数据部分进行压缩，在usbredir的客户端（设备使用端）和服务端（设备接入端）两段，分别布置插件。在服务端，针对性识别出图像数据流，并模拟uvc驱动的工作，把usb数据流（urb包）整理成完整的图片帧（frame），然后对图片帧进行x264的压缩，压缩之后的数据继续通过usbredir传送到客户端。客户端的插件识别到是图片帧数据后，对其进行解压，并把图片帧还原为urb包。以此达成网络间数据的压缩功能（图片压缩，减少包头冗余）。并且以usbredir插件的行事开发。使其具有良好的兼容性（usbredir本身对各平台的兼容性都很优秀）。']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: '亚信科技技术中台全面兼容欧拉生态解决方案',
                                SPEAKER: ['薛浩 亚信科技'],
                                DESC: ['亚信科技的技术中台，采用完整的云原生技术体系构建，历经运营商等行业的大型系统建设上云支撑的考验，已经形成了包括从多云基础设施管理、云原生IaaS的云OS产品、云原生PaaS、边缘云MEC PaaS、Devops等技术中台能力的产品体系，服务公司各个业务产品线。', '云OS，通过统一的云原生架构的平台产品上实现主流公有云、第三方私有云产品，自建云原生IaaS的统一构建和云服务管理。通过k8s云原生的技术构建云OS的统一管理控制面，扩展支持多个第三方云的服务接入，同时也可以基于该控制面基础上管理Openstack和kubernetes（通过扩展kube-virt，kube-ovn等云原生虚拟化组件）来构建IaaS服务。在整个平台的底层计算基础设施兼容性结合华为的鲲鹏+欧拉操作系统实现虚拟机、存储、网络等基础设施云原生虚拟机化能力的构建和开放。', '全域PaaS，包括数据中心级和边缘两套产品，通过一套云原生的架构基础设施层可以结合云OS产品，也可以直接兼容第三方云平台能力，通过PaaS中的弹性计算支持的多平面、mesos和k8s的多集群的纳管和开放服务的能力，在平面级和集群级可以兼容性结合华为的鲲鹏+欧拉操作系统实现PaaS层面向业务和应用的全栈技术服务，已完成落地并服务多运营商客户的CRM、BOSS等核心系统化的国产鲲鹏、欧拉+x86异构双平面的资源池的支撑体系中，目前还在推进结合欧拉打通和边缘MEC PaaS的协同的解决方案，同时推向垂直行业信息化领域。']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: '基于云原生技术分布式构建 Linux 发行版的实践分享',
                                SPEAKER: ['王建民 中国科学院软件研究所'],
                                DESC: ['EulixOS 是最早一批基于 openEuler 操作系统研发的发行版之一。在发行版的研发过程中，时常面对编译构建周期长、依赖关系复杂、软件包迭代频繁的问题，进而时常导致研发中版本不稳定、软件包合入相互等待的问题，尤其是在编译资源有限的情况下。EulixOS在研发过程中，结合团队、资源都有限的情况下，结合云原生技术对编译构建的改造，实现了较为轻量级、易部署、多架构、分布式的编译构建系统，对于更多团队基于openEuler 操作系统进行二次的商业发行版定制有借鉴意义。']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: '从云计算谈系统架构演化趋势',
                                SPEAKER: ['汪照辉  中国银河证券'],
                                DESC: ['对于企业IT系统构建，开源的基础操作是基本的底座，但企业IT系统融合建设的趋势已经非常明显，传统单体建设的思路已经不合时宜，所以对很多企业来说要逐步实现基础设施资源、基础平台、业务应用系统的融合，以适应业务和技术发展的需要。从虚拟化、资源池到超融合、多云管理等，其实目的都是为了实现基础设施资源的融合，能够为上层业务系统提供用之不竭的资源能力。其实从这张图我们可能很清晰的看到多云管理（混合云管理）的重要价值。对于大部分企业来说，多云管理平台不但要管理私有云、公有云，还可能需要管理企业自身的很多物理服务器，以及虚拟化平台所提供的虚拟机管理，这样才能更好的支持上层的容器的调度和管理，以满足不同业务应用容器化对不同基础设施资源的需求。所以企业系统建设中，就不能只考虑单一系统建设，必须要考虑系统与系统之间的关系，就像我们所说的，容器云平台和云管平台就是很紧密的支撑关系，而云管则可能管理着企业的物理服务器、虚拟化、超融合、网络资源、存储资源、私有云、行业云、公有云等基础设施资源，容器云平台又支撑着企业的业务应用，运行着微服务架构的中台服务、中间件、甚至轻量数据库等。所以这是一个整体的体系建设，这也是我们一直提倡“平台融合”的建设思路。当然这并不容易，一个“中台”就让无数企业铩羽而归、爱恨交加，但整个IT系统的建设趋势是逐步走向融合的，系统与系统之间需要标准化的API，就像我们一直说的积木，彼此间的切口要规则、能契合，才能比较快的搭成期待的作品。']
                            },
                            {
                                TIME: '17:00-17:30',
                                THEME: '基于可进化架构的新一代云基础设施',
                                SPEAKER: ['高广生 易捷行云'],
                                DESC: ['面对客户业务快速变化，云平台本身应具备可进化能力，EasyStack的易捷行云新一代云基础设施ECF（EasyStack Cloud Foundation）以开源生态产品化为基础，进行自主创新设计和研发构建的基于数字原生架构的一体化、场景化、可进化的全新一代云平台。已有超过500个客户在使用该产品，云基础设施ECF一套软件栈可以同时支持x86，Arm多种指令集，同时提供包括容器，云主机，裸金属多种算力，支持一个Region同时支持多种CPU架构服务器即一云多芯，同时具备全栈全平⾯OTA（Over The Air）能力，可以平滑⽆感升级包含操作系统在内的所有云平台软件，将不再受限于软件版本的限制，从⽽在某种意义上实现云平台永续⽣命周期。']
                            },
                            {
                                TIME: '17:30-18:00',
                                THEME: '虚拟化硬件加速-vDPA框架以及新浪私有云实践',
                                SPEAKER: ['杨云鹏 新浪'],
                                DESC: ['']
                            },
                        ]
                    },
                    {
                        TITLE: ['Session 3', '兼容性'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: 'HPC应用基于openEuler的迁移实践',
                                SPEAKER: ['李成鹏 软通动力信息技术股份有限公司'],
                                DESC: ['随着大数据、云计算等技术的发展与广泛应用，HPC在行业中的应用也越来越广泛。本次议题将对多款HPC软件到openEuler的跨平台迁移实践进行技术分享。']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: '携手openeuler应对操作系统国产化转型',
                                SPEAKER: ['叶青龙 统信软件'],
                                DESC: ['探讨操作系统国产化转型中的兼容性挑战，并分享统信软件结合迁移工具协助客户解决业务软硬件兼容问题转型欧拉版操作系统。']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: 'SW64自主架构遇上开源欧拉，产业生态兼容的新变革',
                                SPEAKER: ['周元超 普华基础软件'],
                                DESC: ['']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: '欧拉开源社区全球化能力建设与展望',
                                SPEAKER: ['刘鹏 华为'],
                                DESC: ['如何服务好世界各地的开发者，匹配当地的语言、文化、开发习惯和偏好，是openEuler社区深化开源的一大挑战。openEuler G11N SIG，初步探索出了一套全球化理论和方法，并进行了若干全球化实践，希望帮助加快openEuler的全球化的进程。']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: 'oepkgs 开放软件包服务',
                                SPEAKER: ['纪涛 中国科学院软件研究所'],
                                DESC: ['oepkgs 全称开放软件包服务由中国科学院软件研究所、openEuler 社区共同发起并提供支持，旨在为个人开发者、开源社区、OSV、ISV提供免费的软件包、容器镜像的构建、分发和下载服务的第三方平台。', '从使用的角度为大家介绍平台的注册、构建、目标架构的支持、仓库服务、查看日志等流程。', '同时为大家介绍 oepkgs 平台后续会集成的一些功能，例如签名、测试、搜索、集成合规性检查与安全检查等。']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: 'CentOS迁移与操作系统兼容性生态建设',
                                SPEAKER: ['高巍 麒麟软件有限公司'],
                                DESC: ['CentOS替代工作进展、方法及行业案例']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: 'openEuler 兼容性列表建设与实践',
                                SPEAKER: ['李萍  华为'],
                                DESC: ['北向兼容性软件清单来源，覆盖场景']
                            },
                            {
                                TIME: '17:00-17:30',
                                THEME: 'OSV认证体系实践与探索',
                                SPEAKER: ['李君弋 华为'],
                                DESC: ['介绍osv认证方案和认证体系，如何让osv走openEuler的技术路线']
                            },
                        ]
                    },
                    {
                        TITLE: ['Session 4', '安全&可靠性&运维'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: '为数据安全而生，统信软件备份还原工具分享',
                                SPEAKER: ['高冲 统信软件'],
                                DESC: ['统信软件将探讨系统运维中备份与恢复的常用技术方案, 并介绍统信备份还原工具的原理、解决案例以及未来的技术规划。']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: '服务器集中运维管理系统',
                                SPEAKER: ['唐杰 湖南麒麟信安股份有限公司'],
                                DESC: ['支持大批量资产的集中管理，性能监控和告警，日志的集中存储和查询，批量软件升级，批量账户管理，u盘设备管控和安全加固。操作简便，功能强大，提高运维效率。']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: '欧拉开源社区原生运维平台 -- PilotGo',
                                SPEAKER: ['杨昭 麒麟软件有限公司'],
                                DESC: ['PilotGo是openEuler社区原生孵化的运维管理平台，提供大规模集群的主机监控告警、CVE管理、软件包安装升级管理及批量运维操作等功能，保障业务系统安全、稳定运行。同时提供插件机制，对接原有操作系统的多种运维工具，可提供无感知的运维平台切换。']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: '从攻击者角度看Linux内核安全',
                                SPEAKER: ['姚俊/王晓东 360政企安全'],
                                DESC: ['Linux系统在服务器和个人桌面市场有着广泛的使用，作为底层系统，其安全性非常重要。一旦被攻破，商业和个人数据可能被篡改或泄露。本议题以内核中的某个漏洞为案例，除了分析漏洞根因，还会揭秘如何借助该漏洞完成漏洞利用。同时，议题将探讨如何构建更加安全的Linux系统。']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: '基于蓬莱TEE的RISC-V可信机器学习框架',
                                SPEAKER: ['冯二虎 蓬莱TEE'],
                                DESC: ['']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: 'Sec-Anti-SCA基于编译器的CPU侧信道漏洞防护技术',
                                SPEAKER: ['胡科开/吴财军 华为技术有限公司'],
                                DESC: ['自2018年针对处理器cache架构的幽灵和熔断安全漏洞被Google Project Zero曝光以来，新型侧信道漏洞的防护与消减就成为业界热点与难题。业界主流公司如Intel、微软、谷歌等都推出了基于编译器的软硬结合的解决方案，覆盖GCC、LLVM、Visual、C++等主流编译器，典型代表技术有Retpoline、Randpoline等。Gcc-Anti-SCA项目基于GCC编译器提供一个独立安全编译插件，主要针对ARM架构，通过静态代码扫描和模式识别的方式，自动识别源代码中的高风险代码段，并插入ARM架构下相应的安全防护指令。支持ARMv8.5侧信道防护新指令，并向前兼容ARMv8.0及更早的架构。在尽可能多的识别风险点，保证安全性的同时，持续优化，减少误报，把代码性能损失控制在极小的范围内。']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: '操作系统漏洞修复运维探讨',
                                SPEAKER: ['韩永忠  普华基础软件'],
                                DESC: ['对于操作系统安全漏洞已经可实现异常行业检测，漏洞的风险评估以及恶意的程序检测，发现安全隐患后需要等待上游产商给予支持。隐患无法第一时间进行修复。为了解决此问题，操作系统修复的最后一公里：在发现安全隐患后、实现自动获取补丁提交更新计划、提供回退手段形成自动化的运维手段，帮助非云端客户解决本地数据中心的操作系统安全隐患。']
                            },
                            {
                                TIME: '17:00-17:30',
                                THEME: '基于认知技术的openEuler漏洞感知系统',
                                SPEAKER: ['杨牧天 中科微澜'],
                                DESC: ['openEuler开源操作系统作为重要的信息基础设施和生态底座，对自身安全性有很高的要求，为此，我们在openEuler中创新性的引入认知技术，构建openEuler智能化漏洞感知能力。']
                            },
                        ]
                    },
                    {
                        TITLE: ['Session 5', '分布式&多样性计算'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: '仿真软件弹性计算',
                                SPEAKER: ['王松松 哈尔滨工业大学'],
                                DESC: ['大型仿真软件运行时多需要长时间并发运行，遇到某个计算节点挂掉后容易前功尽弃，因此发展弹性计算十分重要']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: 'Arm64上开源分布式存储系统的生态进展',
                                SPEAKER: ['赵帅、刘新良 Linaro'],
                                DESC: ['在Arm64企业市场中，由于其多核并行计算和高性能IO的优势，使得Arm64在分布式存储领域拥有了使用场景。然而软件生态方面，Arm64依然有很长的路要走，不仅仅在于软件使能，项目CI，同时还需要针对相关场景的性能优化。Linaro和会员共同努力，致力于推动分布式存储系统的软件开发和生态进步。目前，我们已经在分布式存储系统，加速库，HPC文件系统等领域取得了一些进展。我们的工作主要基于对项目的使能，CI支持以及针对成熟系统在Arm64上的性能优化，同时也涉及了一些在openEuler上针对HPC文件系统的使能和验证。在本次分享中，我们将详细介绍盖Ceph，Rook, Lustre等项目的Arm CI进展，HPC文件系统的Arm支持以及在OpenEuler中使能和验证，以及利用PMDK等加速库对分布式存储系统进行优化的工作。']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: '华为元戎-分布式多样性算力的理念和探索',
                                SPEAKER: ['梁义 华为'],
                                DESC: ['']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: '欧拉开源社区GCC优化特性介绍及前瞻',
                                SPEAKER: ['马明泽 华为'],
                                DESC: ['']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: '构建openEuler的分布式能力',
                                SPEAKER: ['孙宏伟 华为'],
                                DESC: ['']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: 'CirroData分布式数据库发展方向和工程实践',
                                SPEAKER: ['董山 东方国信'],
                                DESC: ['（1）企业级分布式架构发展方向', '（2）创新技术及在华为平台的工程实践', '（3）技术展望']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: '飞腾平台基础算法优化',
                                SPEAKER: ['阳柳  飞腾信息技术有限公司'],
                                DESC: ['芯片是骨，软件是魂。高水平应用软件是提升飞腾平台的重要手段之一，而高性能的基础算法库是编写高水平应用软件的基础。本议题围绕飞腾软件生态的发展规划，紧密结合用户需求，探讨基础算法优化过程中的经验和收获。']
                            },
                            {
                                TIME: '17:00-17:30',
                                THEME: 'openEuler 容器 OS升级介绍',
                                SPEAKER: ['李元戎 华为'],
                                DESC: ['']
                            },
                            {
                                TIME: '17:30-18:00',
                                THEME: '霄瀚全场景操作系统实践和应用',
                                SPEAKER: ['解伟俊  拓维'],
                                DESC: ['']
                            },
                        ]
                    },
                    {
                        TITLE: ['Session 6', '边缘&嵌入式'],
                        ITEM_LIST: [
                            {
                                TIME: '13:00-13:30',
                                THEME: '欧拉开源操作系统嵌入式方向的发展规划',
                                SPEAKER: ['林子畅 华为技术有限公司'],
                                DESC: ['介绍openEuler在嵌入式方向，与之前服务器领域的异同点，后续可能的特性、功能规划']
                            },
                            {
                                TIME: '13:30-14:00',
                                THEME: '面向嵌入式场景的构建系统Yocto应用与思考',
                                SPEAKER: ['任慰 华为技术有限公司'],
                                DESC: ['当前openEuler的构建系统OBS主要是面向服务器场景的，对于嵌入式场景支持并不好，例如不支持交叉编译，裁剪的力度有限等。为了使openeuler的相关成果能够延伸到嵌入式领域，我们引入了面向嵌入式场景的构建系统Yocto。本议题将分享Yocto的基本情况、如何基于Yocto构建openEuler embedded、存在的问题与挑战以及面向未来的一些思考和规划']
                            },
                            {
                                TIME: '14:00-14:30',
                                THEME: '推动RISC-V软件生态及openEuler在VisionFive开发板的适配',
                                SPEAKER: ['朱潇潇 赛昉科技'],
                                DESC: ['']
                            },
                            {
                                TIME: '14:30-15:00',
                                THEME: 'RV64 异构多核处理器下实现RT-Thread和openeuler同时运行',
                                SPEAKER: ['张海涛 RT-thread'],
                                DESC: ['']
                            },
                            {
                                TIME: '15:00-15:30',
                                THEME: '茶歇',
                            },
                            {
                                TIME: '15:30-16:00',
                                THEME: '云原生边缘计算平台架构与实践',
                                SPEAKER: ['王杰章 华为'],
                                DESC: ['现如今边缘计算的应用场景非常丰富，而且面临着诸多挑战，例如：边云通信网络质量低、边缘资源受限、边缘应用离线自治和本地故障恢复、边缘节点高度分散和资源异构。针对上述问题，我们提出了云原生边缘计算平台的架构与实践——KubeEdge，并配套边缘分布式网络组件EdgeMesh与边缘协调AI框架Sedna。']
                            },
                            {
                                TIME: '16:00-16:30',
                                THEME: '云边协同在太空卫星上的实践探索',
                                SPEAKER: ['林培峰  SUSE'],
                                DESC: ['本议题通过实际的案例分享，探索云边协同技术如何在太空卫星上落地，如何利用云原生、DevSecOpt和边缘技术更好的在太空卫星上使用更低成本硬件，构建更安全可靠软件，实现在太空卫星上更可靠更新软件，以及更好实现AI/ML计算。']
                            },
                            {
                                TIME: '16:30-17:00',
                                THEME: 'Linux实时性实践与探索',
                                SPEAKER: ['郭皓 麒麟软件'],
                                DESC: ['基于openeuler做的Linux实时性探索和研究，已发布Linux嵌入式操作系统demo，支持飞腾、鲲鹏、x86平台']
                            },
                        ]
                    }
                ]
            },
        },
        NAV_LIST: [
            {
                key: '#live',
                name: '精彩回顾'
            },
            {
                key: '#agenda',
                name: '峰会日程'
            },
            {
                key: '#exhibition',
                name: '线上展厅'
            },
            {
                key: '#lecturer',
                name: '演讲嘉宾'
            },
            {
                key: '#publisher',
                name: '出品人'
            },
            {
                key: '#construction',
                name: '共建单位'
            }
        ],
        CONSTRUCTION: {
            WEB_TITLE: "/img/summit/summit2021/Co-construction/web-title.png",
            MOBILE_TITLE: "/img/summit/summit2021/Co-construction/mobile-title.png",
            GUIDANCE: {
                TEXT_TITLE: "指导单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/openaton.png",
                        LINK: ""
                    }
                ]
            },
            HOST: {
                TEXT_TITLE: "主办单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/openEulerlogo.png",
                        LINK: ""
                    }
                ]
            },
            STRATEGIC: {
                TEXT_TITLE: "战略合作单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/huawei.png",
                        LINK: ""
                    }
                ]
            },
            CO_SPONSORED: {
                TEXT_TITLE: "联合主办单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/qilinsoft.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/qilinxinan.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/suse.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/tongxin.png",
                        LINK: ""
                    }
                ]

            },
            CO_ORGANIZER: {
                TEXT_TITLE: "协办单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/yidong.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/dianxing.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/liantong.png",
                        LINK: ""
                    },               
                    {
                        IMG: "/img/summit/summit2021/Co-construction/puhua.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/turbolinux.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/phytium.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/shentai.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/softstone.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/easystack.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/360.png",
                        LINK: ""
                    },  
                    {
                        IMG: "/img/summit/summit2021/Co-construction/dongfangtong.png",
                        LINK: ""
                    },                                 
                ]
            },
            SUPPORT: {
                TEXT_TITLE: "支持单位",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/jdcloud.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/xinlang.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/kengpeng.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/zhongkedachuang.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/tianyuan.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/bessystem.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/qingcloud.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/starfive.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/winhong.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/asiainfo.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/nuclei.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/xsky.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/guoxing.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/iiioka.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/isstech.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/huayun.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/kaifazhineng.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/iscas.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/ruihe.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/langcher.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/xinchen.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/youxi.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/beilian.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/talkweb.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/shenzhou.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/huanghe.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/baixing.png",
                        LINK: ""
                    },
                ]
            },
            FOUNDATION: {
                TEXT_TITLE: "友好基金会",
                LIST: [
                    {
                        IMG: "/img/summit/summit2021/Co-construction/linux.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/openinfra.png",
                        LINK: ""
                    },
                    {
                        IMG: "/img/summit/summit2021/Co-construction/linaro.png",
                        LINK: ""
                    },
                ]
            }
        },
        LECTURER: {
            LECTURER_BANNER: {
                web: '/img/summit/summit2021/lecturer/sperkertitle.png',
                mobile: '/img/summit/summit2021/lecturer/sperkertitle_mo.png'
            },
            LECTURER_LIST: [
                {
                    IMG: '/img/summit/summit2021/lecturer/yangtao.png',
                    NAME: '杨涛',
                    POSITION: '开放原子开源基金会 理事长'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/jiangdayong.png',
                    NAME: '江大勇',
                    POSITION: '欧拉开源社区理事长'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/wuyanjun.png',
                    NAME: '武延军',
                    POSITION: '欧拉开源社区副理事长'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/qiuchengfeng.png',
                    NAME: '邱成锋',
                    POSITION: '欧拉开源社区秘书长'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/huxinwei.png',
                    NAME: '胡欣蔚',
                    POSITION: '欧拉开源社区 技术委员会主席'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/chenhaibo.png',
                    NAME: '陈海波',
                    POSITION: '上海交通大学教授 华为操作系统首席科学家'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/gaowei.png',
                    NAME: '高巍',
                    POSITION: '欧拉开源社区 用户委员会主席'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/qinxiaokang.png',
                    NAME: '秦小康',
                    POSITION: 'SUSE大中华区总裁'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/wangpan.png',
                    NAME: '王攀',
                    POSITION: '麒麟信安副总裁'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/zhanglei.png',
                    NAME: '张磊',
                    POSITION: '统信软件CTO'
                },
            ],
            PUBLISHER_BANNER: {
                web: '/img/summit/summit2021/lecturer/publishertitle.png',
                mobile: '/img/summit/summit2021/lecturer/publishertitle_mo.png'
            },
            PUBLISHER_LIST: [
                {
                    IMG: '/img/summit/summit2021/lecturer/guohanjun.png',
                    NAME: '郭寒军',
                    POSITION: '欧拉开源社区内核 Maintainer'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/liyong.png',
                    NAME: '李勇',
                    POSITION: 'SUSE软件工程顾问'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/yixiujiang.png',
                    NAME: '尹秀江',
                    POSITION: '麒麟软件工程师'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/yanshuanghai.png',
                    NAME: '严海双',
                    POSITION: '中移云能力中心 内核研发专家'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/shenxiang.png',
                    NAME: '沈翔',
                    POSITION: '普华基础软件总经理'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/dukaitian.png',
                    NAME: '杜开田',
                    POSITION: '欧拉开源社区 兼容性SIG组Maintainer'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/yeqinglong.png',
                    NAME: '叶青龙',
                    POSITION: '服务器操作系统项目总监 欧拉开源社区 技术委员会委员'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/liujingang.png',
                    NAME: '刘金刚',
                    POSITION: '欧拉开源社区 技术委员会委员'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/caihaomin.png',
                    NAME: '蔡灏旻',
                    POSITION: '华为容器团队架构师'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/shiyong.png',
                    NAME: '石勇',
                    POSITION: '欧拉开源社区 技术委员会委员'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/panjianfeng.png',
                    NAME: '潘剑锋',
                    POSITION: '360集团副总裁 首席科学家'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/yangliu.png',
                    NAME: '阳柳',
                    POSITION: '飞腾资深软件架构师'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/xiekunxun.png',
                    NAME: '谢焜勋',
                    POSITION: '华为嵌入式操作系统 技术专家'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/lishouyong.png',
                    NAME: '刘寿永',
                    POSITION: ' 中科创达首席架构师'
                },
                {
                    IMG: '/img/summit/summit2021/lecturer/chenjingwei.png',
                    NAME: '陈景伟',
                    POSITION: ' 赛昉生态市场高级总监'
                },
            ]
        },
        SUMMIT_INTRODUCE: "The openEuler Summit is an event for the global developer community and IT professionals who want to learn about openEuler open source products. openEuler has evolved from a server OS into a digital infrastructure (version: 21.09) that supports IT, CT, and OT services in server, cloud native, edge computing, and embedded scenarios. At the openEuler Summit 2021, we invite developers, users, and software enthusiasts to discuss new innovations and features of openEuler, and learn from others in the community.",
        HIGHLIGHTS: "Highlights"
    }
}